// bond_tr.h
// 유가증권주식(채권) 실시간 TR

#pragma once
// 구조체명이 아직 정의가 되지 않은것은 '구조체명정의필요'라고 되어있음
// 번역이 안된건 `char로 시작함
// 주석에 \n이 들어간건 나중에 이쁘게 바꿔야함


// 일반채권 분할상환일 정보
typedef struct _구조체명정의필요 {
	char data_clsf[2];	// DATA구분, BN
	char info_clsf[2];	// 정보구분, 06:일반채권시장
	char mkt_clsf[1];	// 시장구분, 7:채권
	char isin_code[12];	// 종목코드, 표준코드
	char snr[8];	// 일련번호
	`char 분할상환일자[8];	// 분할상환일자, YYYYMMDD
	char filler[16];	// FILLER
	char ff[1];	// FF, END OF TEXT (0xFF)
} 구조체명정의필요;


// 장내채권 대량체결결과
typedef struct _구조체명정의필요 {
	char data_clsf[2];	// DATA구분, C4
	char info_clsf[2];	// 정보구분, 01:장내국채(KTS)시장(채권 512/128K만 제공)\n03:소액채권시장(미제공)\n05:장내RP(REPO)\n06:일반채권시장
	char mkt_clsf[1];	// 시장구분, 7:채권
	char isin_code[12];	// 종목코드
	`char RFQ거래량[20];	// RFQ거래량, 장내RP(REPO) :RFQ 거래대금(단위:원)\n그외 :종목별 RFQ 총거래량(수량단위:천원)
	`char 신고매매거래량[20];	// 신고매매거래량, 수량단위:천원\n종목별 신고매매 총거래량\n장내RP(REPO) : 일반신고+국채금융신고+정부레포신고\n그외 : 일반신고
	char filler[2];	// FILLER
	char ff[1];	// FF, END OF TEXT(0xFF)
} 구조체명정의필요;


// 채권 외국인 확정치데이터재전송
typedef struct _구조체명정의필요 {
	char data_clsf[2];	// DATA구분, F4
	char info_clsf[2];	// 정보구분, 01:주식 90:기타
	char mkt_clsf[1];	// 시장구분, 1:유가증권 2:코스닥 3:프리보드 7:채권
	char isin_code[12];	// 종목코드, 표준코드
	`char 종목한도비율[5];	// 종목한도비율, 9V9999 (예:15%일때 → 01500으로 전송)
	`char 개인한도비율[5];	// 개인한도비율, 9V9999 (예:15%일때 → 01500으로 전송)
	`char 상장주식수[15];	// 상장주식수, 단위:주
	char ordbl_qty[15];	// 주문가능수량, 단위:주
	`char 한도소진구분[1];	// 한도소진구분, 0:정상 1:한도초과 2:추가 3:삭제
	char filler[1];	// FILLER, SPACE
	char ff[1];	// FF, END OF TEXT (0xFF)
} 구조체명정의필요;


// 채권 외국인 종목별투자정보_확정치
typedef struct _구조체명정의필요 {
	char data_clsf[2];	// DATA구분, F1
	char info_clsf[2];	// 정보구분, 01:주식 90:기타
	char mkt_clsf[1];	// 시장구분, 1:유가증권 2:코스닥 3:프리보드 7:채권
	char isin_code[12];	// 종목코드, 표준코드
	char snr[8];	// 일련번호, 1~99999999 건수체크용
	char trd_date[8];	// 매매일자, YYYYMMDD
	`char 종목한도비율[5];	// 종목한도비율, 9V9999 (예:15%일때 → 01500으로 전송)
	`char 개인한도비율[5];	// 개인한도비율, 9V9999 (예:15%일때 → 01500으로 전송)
	`char 상장주식수[15];	// 상장주식수, 단위:주
	char ordbl_qty[15];	// 주문가능수량, 단위:주
	`char 한도소진구분[1];	// 한도소진구분, 0:정상 1:한도소진 2:한도종목신규지정 3:한도종목해지
	char filler[5];	// FILLER, SPACE
	char ff[1];	// FF, END OF TEXT (0xFF)
} 구조체명정의필요;


// 채권 외국인 주문가능수량
typedef struct _구조체명정의필요 {
	char data_clsf[2];	// DATA구분, F2
	char info_clsf[2];	// 정보구분, 01:주식 90:기타
	char mkt_clsf[1];	// 시장구분, 1:유가증권 2:코스닥 3:프리보드 7:채권
	char isin_code[12];	// 종목코드, 표준코드
	char ordbl_qty[15];	// 주문가능수량, 단위:주(양수만 존재)
	`char 데이터종류[2];	// 데이터종류, 01:주문가능수량(실시간) 07:잠정치주문가능수량(종가)
	char filler[5];	// FILLER, SPACE
	char ff[1];	// FF, END OF TEXT (0xFF)
} 구조체명정의필요;


// 일반채권 시장지수 배치
typedef struct _구조체명정의필요 {
	char data_clsf[2];	// DATA구분, G2
	char info_clsf[2];	// 정보구분, 06:장내일반채권
	char mkt_clsf[1];	// 시장구분, 7:채권
	char snr[8];	// 일련번호, 1~99999999 건수체크용
	`char 산출일[8];	// 산출일, YYYYMMDD
	`char 그룹코드[5];	// 그룹코드, XXXXX
	`char 만기코드[3];	// 만기코드, XXX
	`char 순가격지수[15];	// 순가격지수, 999999999V999999
	`char 총수익지수[15];	// 총수익지수, 999999999V999999
	`char 시장가격지수[15];	// 시장가격지수, 999999999V999999
	`char 0재투자지수[15];	// 0재투자지수, 999999999V999999
	`char 콜재투자지수[15];	// 콜재투자지수, 999999999V999999
	`char 순가격지수비중[15];	// 순가격지수비중, 999999999V999999
	`char 총수익지수비중[15];	// 총수익지수비중, 999999999V999999
	`char 시장가격지수비중[15];	// 시장가격지수비중, 999999999V999999
	`char 0재투자지수비중[15];	// 0재투자지수비중, 999999999V999999
	`char 콜재투자지수비중[15];	// 콜재투자지수비중, 999999999V999999
	`char 지수합성용순가격 지수비중[15];	// "지수합성용순가격 지수비중", 999999999V999999
	`char 지수합성용총수익 지수비중[15];	// "지수합성용총수익 지수비중", 999999999V999999
	`char 지수합성용0재투자 지수비중[15];	// "지수합성용0재투자 지수비중", 999999999V999999
	`char 지수합성용콜재투자 지수비중[15];	// "지수합성용콜재투자 지수비중", 999999999V999999
	`char 평균듀레인션[15];	// 평균듀레인션, 999999999V999999
	`char 평균컨벡서티[15];	// 평균컨벡서티, 999999999V999999
	`char 평균수익률[15];	// 평균수익률, 999999999V999999
	`char 평균쿠폰[15];	// 평균쿠폰, 999999999V999999
	`char 평균잔존만기[15];	// 평균잔존만기, 999999999V999999
	`char 평균 현재 수익률[15];	// 평균 현재 수익률, 999999999V999999
	`char 평균 스프레드 부호[1];	// 평균 스프레드 부호, -
	`char 평균 스프레드[15];	// 평균 스프레드, 999999999V999999
	`char 종목수[8];	// 종목수
	`char 발행잔액[20];	// 발행잔액
	`char 발행잔액비중[15];	// 발행잔액비중, 999999999V999999
	`char 시가총액[20];	// 시가총액
	`char 시가총액비중[15];	// 시가총액비중, 999999999V999999
	`char 누적현금[25];	// 누적현금, 9999999999999999999V999999
	`char 발생현금[25];	// 발생현금, 9999999999999999999V999999
	`char 콜재투자현금[25];	// 콜재투자현금, 9999999999999999999V999999
	char filler[1];	// FILLER, SPACE
	char ff[1];	// FF, END OF TEXT (0xFF)
} 구조체명정의필요;


// 국채시장지수그룹_만기코드
typedef struct _구조체명정의필요 {
	char data_clsf[2];	// DATA구분, G1
	char info_clsf[2];	// 정보구분, 01:국채
	char mkt_clsf[1];	// 시장구분, 7:채권
	char snr[8];	// 일련번호, 1~99999999 건수체크용
	`char 코드구분[1];	// 코드구분, 1:그룹코드 2:만기코드
	`char 적용일[8];	// 적용일, YYYYMMDD
	`char 그룹/만기코드[5];	// 그룹/만기코드, 그룹코드:"XXXXX", 만기코드:"XXX "
	`char 그룹/만기코드명[30];	// 그룹/만기코드명
	`char 그룹/만기코드단계[1];	// 그룹/만기코드단계, 그룹코드:0,1 만기코드:0,1,2
	char filler[1];	// FILLER, SPACE
	char ff[1];	// FF, END OF TEXT (0xFF)
} 구조체명정의필요;


// 한경채권지수
typedef struct _구조체명정의필요 {
	char data_clsf[2];	// DATA구분, ※개발가이드 참조
	char info_clsf[2];	// 정보구분, 01:장내국채, 07:장외채권
	char mkt_clsf[1];	// 시장구분, 7:채권
	char filler1[4];	// FILLER, 일련번호->FILLER 2010.11.08
	`char 지수ID[6];	// 지수ID, ※개발가이드 참조
	`char 기준일자[8];	// 기준일자, YYYYMMDD
	`char 기준시각[6];	// 기준시각, HHMMSS(종가지수일 경우 : JUNJJJ)
	`char 총수익지수[10];	// 총수익지수, 9(6)V9(4)
	`char 클린가격지수[10];	// 클린가격지수, 9(6)V9(4)
	`char 시장가격지수[10];	// 시장가격지수, 9(6)V9(4)
	`char Call 재투자지수[10];	// Call 재투자지수, 9(6)V9(4)
	`char Zero 재투자지수[10];	// Zero 재투자지수, 9(6)V9(4)
	`char 선물이론가격[9];	// 선물이론가격, 9(7)V9(2)
	`char 평균듀레이션[6];	// 평균듀레이션, 9(3)V9(3)
	`char 평균컨벡서티[6];	// 평균컨벡서티, 9(3)V9(3)
	`char 평균YTM[6];	// 평균YTM, 9(3)V9(3) (%)
	`char 평균선도YTM[6];	// 평균선도YTM, 9(3)V9(3) (%)
	char filler2[1];	// FILLER, SPACE
	char ff[1];	// FF, END OF TEXT (0xFF)
} 구조체명정의필요;


// 발행정보(소액채권)
typedef struct _구조체명정의필요 {
	char data_clsf[2];	// DATA구분, F9 (주식관련사채, 소액채권)
	char info_clsf[2];	// 정보구분, 03:장내소액채권 04:장내주식관련사채
	char mkt_clsf[1];	// 시장구분, 7:채권
	char isin_code[12];	// 종목코드, 표준코드
	char snr[8];	// 일련번호, 1~99999999 건수체크용
	`char 종목약명[40];	// 종목약명
	`char 발행일자[8];	// 발행일자, YYYYMMDD
	`char 상환일자[8];	// 상환일자, YYYYMMDD
	`char 상장일자[8];	// 상장일자, YYYYMMDD
	`char 이자지금방법[2];	// 이자지금방법, 고정금리형(11:할인채,12:복리채, 13:이표채, 14:단리채, \n 15:복5단2, 19:기타), \n 변동금리형(21:이표채,22:복리채, 23:단리채,29:기타)
	`char 발행금액[22];	// 발행금액, 999999999999999999.999 단위 1원(포인트)
	`char 상장금액[22];	// 상장금액, 999999999999999999.999 단위 1원(포인트)
	`char 이표지급방법코드[1];	// 이표지급방법코드, 1:선금 2:후금
	`char 거치개월수[4];	// 거치개월수, 개월수로 입력(분할상환구분이 원금균등,원리금균등의\n 경우사용)
	`char 분할상환횟수[5];	// 분할상환횟수, 분할 상환횟수 표시
	`char 채권이자지급일기준구분코드[1];	// 채권이자지급일기준구분코드, 1:발행일 2:상환일
	`char 이자월말구분코드[1];	// 이자월말구분코드, 1:일자기준 2:말일기준
	`char 표면이자율[14];	// 표면이자율, 99999999.99999, 표면이자율
	`char 대용가[6];	// 대용가
	`char 대상종목코드[12];	// 대상종목코드
	`char 행사개시일자[8];	// 행사개시일자, YYYYMMDD
	`char 행사종료일자[8];	// 행사종료일자, YYYYMMDD
	`char 배당기산일구분코드[1];	// 배당기산일구분코드, 1:행사일 2:직전년도말 3:당해년도말
	`char 행사비율[7];	// 행사비율, 9999.99, 행사의 의미 : 전환권행사, 신주인수권행사, 교환권행사등을 포함
	`char 보장수익률[13];	// 보장수익률, 999999.999999, 만기에 발행사에서 보장하는 만기보장\n 수익률(예:8%등)
	`char 주식관련사채권리행사가격[11];	// 주식관련사채권리행사가격, 9->11, 9999999.999
	`char 종목단축코드[9];	// 종목단축코드
	`char 소액채권코드[3];	// 소액채권코드, ※ 코드값모음 참조
	char filler[10];	// FILLER, SPACE
	char ff[1];	// FF, END OF TEXT (0xFF)
} 구조체명정의필요;


// 소액채권_신고시장수익률
typedef struct _구조체명정의필요 {
	char data_clsf[2];	// DATA구분, G0
	char info_clsf[2];	// 정보구분, 03:장내소액채권
	char mkt_clsf[1];	// 시장구분, 7:채권
	char snr[8];	// 일련번호, 1~99999999 건수체크용
	`char 일자[8];	// 일자, YYYYMMDD
	`char 소액채권코드[3];	// 소액채권코드, ※ 코드값모음 참조
	`char 신고 시장수익률[13];	// 신고 시장수익률, 1000000
	`char 신고 시장수익률 가격[11];	// 신고 시장수익률 가격, 9999999.999
	`char 종가수익률[13];	// 종가수익률, 1000000
	`char 종가수익률 가격[11];	// 종가수익률 가격, 9999999.999
	char filler[7];	// FILLER, SPACE
	char ff[1];	// FF, END OF TEXT (0xFF)
} 구조체명정의필요;


// 발행정보(주식관련사채)
typedef struct _구조체명정의필요 {
	char data_clsf[2];	// DATA구분, F9 (주식관련사채, 소액채권)
	char info_clsf[2];	// 정보구분, 03:장내소액채권 04:장내주식관련사채
	char mkt_clsf[1];	// 시장구분, 7:채권
	char isin_code[12];	// 종목코드, 표준코드
	char snr[8];	// 일련번호, 1~99999999 건수체크용
	`char 종목약명[40];	// 종목약명
	`char 발행일자[8];	// 발행일자, YYYYMMDD
	`char 상환일자[8];	// 상환일자, YYYYMMDD
	`char 상장일자[8];	// 상장일자, YYYYMMDD
	`char 이자지금방법[2];	// 이자지금방법, 고정금리형(11:할인채,12:복리채, 13:이표채, 14:단리채, \n 15:복5단2, 19:기타), \n 변동금리형(21:이표채,22:복리채, 23:단리채,29:기타)
	`char 발행금액[22];	// 발행금액, 999999999999999999.999 단위 1원(포인트)
	`char 상장잔액[22];	// 상장잔액, 999999999999999999.999 단위 1원(포인트)
	`char 이표지급방법코드[1];	// 이표지급방법코드, 1:선금 2:후금
	`char 거치개월수[4];	// 거치개월수, 개월수로 입력(분할상환구분이 원금균등,원리금균등의\n 경우사용)
	`char 분할상환횟수[5];	// 분할상환횟수, 분할 상환횟수 표시
	`char 채권이자지급일기준구분코드[1];	// 채권이자지급일기준구분코드, 1:발행일 2:상환일
	`char 이자월말구분코드[1];	// 이자월말구분코드, 1:일자기준 2:말일기준
	`char 표면이자율[14];	// 표면이자율, 99999999.99999, 표면이자율
	`char 대용가[6];	// 대용가
	`char 대상종목코드[12];	// 대상종목코드
	`char 행사개시일자[8];	// 행사개시일자, YYYYMMDD
	`char 행사종료일자[8];	// 행사종료일자, YYYYMMDD
	`char 배당기산일구분코드[1];	// 배당기산일구분코드, 1:행사일 2:직전년도말 3:당해년도말
	`char 행사비율[7];	// 행사비율, 9999.99, 행사의 의미 : 전환권행사, 신주인수권행사, 교환권행사등을 포함
	`char 보장수익률[13];	// 보장수익률, 999999.999999, 만기에 발행사에서 보장하는 만기보장\n 수익률(예:8%등)
	`char 주식관련사채권리행사가격[11];	// 주식관련사채권리행사가격, 9->11, 9999999.999
	`char 종목단축코드[9];	// 종목단축코드
	`char 소액채권코드[3];	// 소액채권코드
	char filler[10];	// FILLER, SPACE
	char ff[1];	// FF, END OF TEXT (0xFF)
} 구조체명정의필요;


// 소매채권 종목배치
typedef struct _구조체명정의필요 {
	char data_clsf[2];	// DATA구분, A0
	char info_clsf[2];	// 정보구분, 02:장내소매채권
	char mkt_clsf[1];	// 시장구분, 7:채권
	char isin_code[12];	// 종목코드
	char snr[8];	// 일련번호, 1~99999999 건수체크용
	`char 적용일[8];	// 적용일, YYYYMMDD 익일 거래일자
	`char 소매채권분류코드[2];	// 소매채권분류코드, GA:국채 MA:통안채 BA:금융채 \nSA:비금융특수채 CA:회사채 \nET:지방채 ,EC:기타\n*구명칭:소매종류코드
	`char 한글종목명[40];	// 한글종목명
	`char 영문종목약명[40];	// 영문종목약명
	`char 채권상장구분코드[1];	// 채권상장구분코드, Y:상장 D:상장폐지 E:기타 I:미발행 N:비상장 2014.03.03\n*구명칭:상장여부
	`char 채권분류코드[6];	// 채권분류코드, 채권분류코드 참조
	`char 채권보증구분코드[1];	// 채권보증구분코드, 1:보증 2:부분보증 3:담보부 4:무보증 5:정부보증 6:커버드본드 (2015.12.14)\n*구명칭:보증구분
	`char 이자지급방법코드[2];	// 이자지급방법코드, 고정금리형\n11:할인채 12:복리채 13:이표채 14:단리채 15:복5단2\n19:기타\n변동금리형\n21:이표채 22:복리채 23:단리채 29:기타\n*구명칭:이자지급방법
	`char 상장일[8];	// 상장일
	`char 발행일[8];	// 발행일
	`char 상환일[8];	// 상환일, 영구채이면 '99991231'값 전송
	`char 매출일[8];	// 매출일, 원천징수를 하지 않는 선매출채권\n(은행채 등, 단 소액국공채는 표기안함)
	`char 채권발행율[11];	// 채권발행율, 99999V999999 발행율이라고도 함 2014.03.03\n*구명칭:발행가액
	`char 표면이자율[12];	// 표면이자율, 99999999V99999 FRN 채권:발행기준금리+가산금리 \n8->12 2014.03.03
	`char 이자지급계산월수[3];	// 이자지급계산월수, 0:불규칙 0<이자지급계산월수:규칙은 개월수\n(이표채, 복리채, 나머지는 표기 않음)
	`char 이표지급방법코드[1];	// 이표지급방법코드, 1:선급 2:후급\n*구명칭:이자선후급구분 2014.03.03
	`char 채권이자일지급기준구분코드[1];	// 채권이자일지급기준구분코드, 1:발행일 2:상환일\n*구명칭:이자일지급기준구분
	`char 이자월말구분코드[1];	// 이자월말구분코드, 1:일자기준 2:말일기준\n*구명칭:이자월말구분 2014.03.03
	`char 이자원단위미만처리코드[1];	// 이자원단위미만처리코드, 1:절사 2:절상 3:사사오입 4:원미만 인정\n*구명칭:이자원단위미만처리구분 2014.03.03
	`char 채권선매출이자지급방법코드[1];	// 채권선매출이자지급방법코드, 1:매출시 2:최초이자지급시 3:상환시 4:매출시(국고채유형)\n*구명칭:선매출이자지급방법 2014.03.03
	`char 발행금액[18];	// 발행금액, 단위:원(포인트)\n15 -> 18 2014.03.03
	`char 상장금액[18];	// 상장금액, 단위:원(포인트)\n15 -> 18 2014.03.03
	`char 만기상환비율[11];	// 만기상환비율, 99999V999999 만기에 상환하는 비율\n8->11\n*구명칭:만기상환률 2014.03.03
	`char 분할상환유형구분코드[1];	// 분할상환유형구분코드, 1:원금균등 2:원리금균등 3:불균등(분할상환채 경우 사용)\n*구명칭:분할상환구분 2014.03.03
	`char 거치개월수[3];	// 거치개월수, 개월수(원금균등, 원리금균등등 불할상환채의 거치기간)\n*구명칭:거치기간 2014.03.03
	`char 분할상환횟수[4];	// 분할상환횟수, 원금균등, 원리금균등 분할상환채의 분할상환횟수
	`char 거래정지여부[1];	// 거래정지여부, Y:거래정지, N:정상 2014.03.03
	`char 전기이자지급일자[8];	// 전기이자지급일자, *구명칭:직전 이자지급일 2014.03.03
	`char 차기이자지급일자[8];	// 차기이자지급일자, *구명칭:차기 이자지급일 2014.03.03
	`char 영구채권만기구조여부[1];	// 영구채권만기구조여부, Y:해당 N:미해당\n*구명칭:하이브리드채권 여부 2014.03.03
	`char 채권스트립구분코드[1];	// 채권스트립구분코드, 1:일반채권 2:원금분리 3:이자분리\n*구명칭:스트립구분 2014.03.03
	char base_prc[9];	// 기준가격, 5->9\n*구명칭:이상호가기준가 2014.03.03
	`char 정리매매여부[1];	// 정리매매여부, N: 정리매매비대상, Y: 정리매매대상\n*구명칭:정리매매대상 여부 2014.03.03
	`char 투자유의채권구분코드[1];	// 투자유의채권구분코드, 0: 해당없음 1: 지정예고 2: 지정
	char filler[6];	// FILLER, SPACE 1->7 2014.03.03\n7->6 2016.11.28
	char ff[1];	// FF, END OF TEXT (0xFF)
} 구조체명정의필요;


// 소매채권 소매종류코드
typedef struct _구조체명정의필요 {
	char data_clsf[2];	// DATA구분, G3
	char info_clsf[2];	// 정보구분, 02:장내소매채권
	char mkt_clsf[1];	// 시장구분, 7:채권
	char snr[8];	// 일련번호, 1~99999999 건수체크용
	`char 소매채권분류코드[2];	// 소매채권분류코드, GA:국채 MA:통안채 BA:금융채 SA:비금융특수채 CA:회사채\nET:지방채 ,EC:기타\n*구명칭:소매종류코드 2014.03.03
	`char 소매종목분류한글명[20];	// 소매종목분류한글명
	`char 소매종목분류영문명[20];	// 소매종목분류영문명
	`char 소매채권조성호가가능여부[1];	// 소매채권조성호가가능여부, N:조성호가제출불가 Y:조성호가제출가능\n*구명칭:조성호가제출구분 2014.03.03
	char filler[3];	// FILLER, SPACE
	char ff[1];	// FF, END OF TEXT (0xFF)
} 구조체명정의필요;


// 환매조건부채권_REPO_배치
typedef struct _구조체명정의필요 {
	char data_clsf[2];	// DATA구분, A0
	char info_clsf[2];	// 정보구분, 05:장내RP(REPO)
	char mkt_clsf[1];	// 시장구분, 7:채권
	char isin_code[12];	// 종목코드, ※종목정보만 해당
	char snr[8];	// 일련번호, 1~99999999 건수체크용
	`char DATA 분류[2];	// DATA 분류, 01:분류정보 02:종목정보
	`char 적용일[8];	// 적용일, 익일(토요일 포함) ※분류정보, 종목정보 공통
	`char 분류코드[2];	// 분류코드, GA:국고채 SA:통안채/예보채 CA:기타채권※분류정보만 해당
	`char 분류명[20];	// 분류명, ※분류정보만 해당 10→20 2011.02.14
	`char 한글약명[40];	// 한글약명, ※당 FIELD 이하 종목정보만 해당
	`char 시장가치[12];	// 시장가치, 수익률을 적용시킨 가격으로 1만원에 대한 환산가격\n(단위:원)\n999999999V999\n5->12 2014.03.03
	char filler[30];	// FILLER, 7->5BYTES(2011.02.14) SPACE\n5->30BYTES(2014.03.03) SPACE
	char ff[1];	// FF, END OF TEXT (0xFF) 130→140 2011.02.14
} 구조체명정의필요;


// 장외채권호가/체결(프리본드)
typedef struct _구조체명정의필요 {
	char data_clsf[2];	// DATA구분, L9
	char info_clsf[2];	// 정보구분, 07:장외채권
	char mkt_clsf[1];	// 시장구분, 7:채권
	char isin_code[12];	// 종목코드, 거래 채권 종목코드
	`char DATA소구분[2];	// DATA소구분, H1:호가체결정보 H2:호가체결변경내역
	char filler1[1];	// FILLER, 정보원구분 SPACE 2011.08.29 부터 FILLER처리
	char snr[8];	// 일련번호
	`char 원일련번호[8];	// 원일련번호, H1 정보일 경우 : 00000000
	`char 교체구분[1];	// 교체구분, 0:일반주문, 1:교체주문
	`char 교체원일련번호[8];	// 교체원일련번호, 교체주문의 2번째 시세가 아닐 경우 : 00000000
	`char 입력일자[8];	// 입력일자, YYYYMMDD
	`char 호가제시시간[6];	// 호가제시시간, 호가 발생시간(HHMMSS)
	`char 채권 종목명[40];	// 채권 종목명, 거래채권 종목명
	`char 변경구분[1];	// 변경구분, 1:신규, 2:수정, 3:삭제
	`char 시세구분[1];	// 시세구분, 1:수익률, 2:가격
	`char 수익률(호가/체결)[8];	// 수익률(호가/체결), 999V99999 (-수익률발생시 -99V99999)
	`char 가격(호가/체결)[8];	// 가격(호가/체결), 99999V999
	`char 매매구분[1];	// 매매구분, 1:매수, 2:매도, 3:체결
	`char 호가수량[16];	// 호가수량, 원(매매구분이 매수/매도일 때만 값이 있음)
	`char 매매일[2];	// 매매일, 1:선네고, 2:T+0, 3:T+1, 4:T+2, ~ 32:T+30
	`char 결제일[2];	// 결제일, 2:T+0(당일), 3:T+1(익일), 4:T+2, ~ 32:T+30
	char filler2[11];	// FILLER, SPACE
	char ff[1];	// FF, END OF TEXT (0xFF)
} 구조체명정의필요;


// MKF_채권지수
typedef struct _구조체명정의필요 {
	char data_clsf[2];	// DATA구분, ※개발가이드 참조
	char info_clsf[2];	// 정보구분, 01:장내국채, 07:장외채권
	char mkt_clsf[1];	// 시장구분, 7:채권
	char filler1[4];	// FILLER, 일련번호->FILLER 2010.11.08
	`char 지수ID[6];	// 지수ID, ※개발가이드 참조
	`char 기준일자[8];	// 기준일자, YYYYMMDD
	`char 기준시각[6];	// 기준시각, HHMMSS(종가지수일 경우 : JUNJJJ)
	`char 총수익지수[10];	// 총수익지수, 9(6)V9(4)
	`char 클린가격지수[10];	// 클린가격지수, 9(6)V9(4)
	`char 시장가격지수[10];	// 시장가격지수, 9(6)V9(4)
	`char Call 재투자지수[10];	// Call 재투자지수, 9(6)V9(4)
	`char Zero 재투자지수[10];	// Zero 재투자지수, 9(6)V9(4)
	`char 선물이론가격[9];	// 선물이론가격, 9(7)V9(2)
	`char 평균듀레이션[6];	// 평균듀레이션, 9(3)V9(3)
	`char 평균컨벡서티[6];	// 평균컨벡서티, 9(3)V9(3)
	`char 평균YTM[6];	// 평균YTM, 9(3)V9(3) (%)
	`char 평균선도YTM[6];	// 평균선도YTM, 9(3)V9(3) (%)
	char filler2[1];	// FILLER, SPACE
	char ff[1];	// FF, END OF TEXT (0xFF)
} 구조체명정의필요;


// MKF_채권지수 구성종목정보
typedef struct _구조체명정의필요 {
	char data_clsf[2];	// DATA구분, ※개발가이드 참조
	char info_clsf[2];	// 정보구분, 01:장내국채, 07:장외채권
	char mkt_clsf[1];	// 시장구분, 7:채권
	char filler1[4];	// FILLER, 일련번호→FILLER 2010.11.08
	`char 지수ID[6];	// 지수ID, ※개발가이드 참조
	`char 기준일자[8];	// 기준일자, YYYYMMDD
	`char 기준시각[6];	// 기준시각, HHMMSS(종가지수일 경우 : JUNJJJ)
	char isin_code[12];	// 종목코드
	`char 기준가격(평가가격)[9];	// 기준가격(평가가격), 9(7)V9(2) 단위:원
	`char 클린가격[9];	// 클린가격, 9(7)V9(2) 단위:원
	`char (확정)YTM[6];	// (확정)YTM, 9(3)V9(3)
	`char 지수편입여부[1];	// 지수편입여부, 1:지수편입종목 0:지수에 편입되지 않으나 ETF에 편입된 종목\n 신규 2011.07.18
	char filler2[3];	// FILLER, 신규 2011.07.18
	char ff[1];	// FF, END OF TEXT (0xFF)
} 구조체명정의필요;


// KIS_채권지수
typedef struct _구조체명정의필요 {
	char data_clsf[2];	// DATA구분, ※개발가이드 참조
	char info_clsf[2];	// 정보구분, 01:장내국채, 07:장외채권
	char mkt_clsf[1];	// 시장구분, 7:채권
	char filler1[4];	// FILLER, 일련번호->FILLER 2010.11.08
	`char 지수ID[6];	// 지수ID, ※개발가이드 참조
	`char 기준일자[8];	// 기준일자, YYYYMMDD
	`char 기준시각[6];	// 기준시각, HHMMSS(종가지수일 경우 : JUNJJJ)
	`char 총수익지수[10];	// 총수익지수, 9(6)V9(4)
	`char 클린가격지수[10];	// 클린가격지수, 9(6)V9(4)
	`char 시장가격지수[10];	// 시장가격지수, 9(6)V9(4)
	`char Call 재투자지수[10];	// Call 재투자지수, 9(6)V9(4)
	`char Zero 재투자지수[10];	// Zero 재투자지수, 9(6)V9(4)
	`char 선물이론가격[9];	// 선물이론가격, 9(7)V9(2)
	`char 평균듀레이션[6];	// 평균듀레이션, 9(3)V9(3)
	`char 평균컨벡서티[6];	// 평균컨벡서티, 9(3)V9(3)
	`char 평균YTM[6];	// 평균YTM, 9(3)V9(3) (%)
	`char 평균선도YTM[6];	// 평균선도YTM, 9(3)V9(3) (%)
	char filler2[1];	// FILLER, SPACE
	char ff[1];	// FF, END OF TEXT (0xFF)
} 구조체명정의필요;


// KIS_채권지수 구성종목정보
typedef struct _구조체명정의필요 {
	char data_clsf[2];	// DATA구분, ※개발가이드 참조
	char info_clsf[2];	// 정보구분, 01:장내국채, 07:장외채권
	char mkt_clsf[1];	// 시장구분, 7:채권
	char filler1[4];	// FILLER, 일련번호->FILLER 2010.11.08
	`char 지수ID[6];	// 지수ID, ※개발가이드 참조
	`char 기준일자[8];	// 기준일자, YYYYMMDD
	`char 기준시각[6];	// 기준시각, HHMMSS(종가지수일 경우 : JUNJJJ)
	char isin_code[12];	// 종목코드
	`char 기준가격(평가가격)[9];	// 기준가격(평가가격), 9(7)V9(2) 단위:원
	`char 클린가격[9];	// 클린가격, 9(7)V9(2) 단위:원
	`char (확정)YTM[6];	// (확정)YTM, 9(3)V9(3)
	`char 지수편입여부[1];	// 지수편입여부, 1:지수편입종목 0:지수에 편입되지 않으나 ETF에 편입된 종목\n 신규 2011.07.18
	char filler2[3];	// FILLER, 신규 2011.07.18
	char ff[1];	// FF, END OF TEXT (0xFF)
} 구조체명정의필요;


// 채권_종목 이벤트 정보
typedef struct _구조체명정의필요 {
	char data_clsf[2];	// DATA구분, I6
	char info_clsf[2];	// 정보구분, 01:국채, 03:소액채권, 05:REPO, 06:일반
	char mkt_clsf[1];	// 시장구분, 7:채권
	char isin_code[12];	// 종목코드, 표준코드
	char snr[8];	// 일련번호, 1~99999999 건수체크용
	`char 이벤트종류코드[2];	// 이벤트종류코드, 01:거래정지 \n02:관리종목 \n03:불성실공시법인 \n04:정리매매\n05:우회상장 \n06:대용증권효력정지 \n07:지배구조우량기업\n08:차입공매도불가 \n09:Regulation S \n10:벤쳐기업지정\n11:투자주의환기종목\n12:단기과열종목 (2012.11.05추가)\n13:휴장 (2016.06.27추가)\n14:초저유동성종목 (2016.06.27추가)\n15:투자유의채권 (2016.11.28추가)\n16:이상급등종목 (2017.03.27추가)\n17:공매도과열종목 (2017.03.27 추가)
	`char 이벤트발생사유코드[4];	// 이벤트발생사유코드, ※ 별첨 코드갑모음의 이벤트별사유코드 참조\n※ 데이터 타입이 X모드 이기 때문에 죄측정렬됩니다.\n (거래정지사유코드(3자리)
	`char 개시일자,시작일자,적용일자[8];	// "개시일자,시작일자,적용일자", YYYYMMDD
	`char 만료일자,종료일자[8];	// 만료일자,종료일자, YYYYMMDD
	char filler[2];	// FILLER, SPACE
	char ff[1];	// FF, END OF TEXT (0xFF)
} 구조체명정의필요;


// 환매조건부채권(REPO) 우선호가
typedef struct _구조체명정의필요 {
	char data_clsf[2];	// DATA구분, B6
	char info_clsf[2];	// 정보구분, 05:환매조건부채권(REPO)
	char mkt_clsf[1];	// 시장구분, 7:채권
	char isin_code[12];	// 종목코드, 종목코드 및 REPO분류코드
	char brd_id[2];	// 보드ID, 코드값모음 참조
	`char REPO기간[4];	// REPO기간
	`char 매도호가총잔량[12];	// 매도호가총잔량, 수량단위:천원
	`char 매수호가총잔량[12];	// 매수호가총잔량, 수량단위:천원
	`char 매도1단계우선호가가격[11];	// 매도1단계우선호가가격, REPO 가격표현:상품개발가이드참조.. 종목우선호가
	`char 매도1단계우선호가잔량[12];	// 매도1단계우선호가잔량, 종목우선호가
	`char 매도2단계우선호가가격[11];	// 매도2단계우선호가가격, 종목우선호가
	`char 매도2단계우선호가잔량[12];	// 매도2단계우선호가잔량, 종목우선호가
	`char 매도3단계우선호가가격[11];	// 매도3단계우선호가가격, 종목우선호가
	`char 매도3단계우선호가잔량[12];	// 매도3단계우선호가잔량, 종목우선호가
	`char 매도4단계우선호가가격[11];	// 매도4단계우선호가가격, 종목우선호가
	`char 매도4단계우선호가잔량[12];	// 매도4단계우선호가잔량, 종목우선호가
	`char 매도5단계우선호가가격[11];	// 매도5단계우선호가가격, 종목우선호가
	`char 매도5단계우선호가잔량[12];	// 매도5단계우선호가잔량, 종목우선호가
	`char 매수1단계우선호가가격[11];	// 매수1단계우선호가가격, 종목우선호가
	`char 매수1단계우선호가잔량[12];	// 매수1단계우선호가잔량, 종목우선호가
	`char 매수2단계우선호가가격[11];	// 매수2단계우선호가가격, 종목우선호가
	`char 매수2단계우선호가잔량[12];	// 매수2단계우선호가잔량, 종목우선호가
	`char 매수3단계우선호가가격[11];	// 매수3단계우선호가가격, 종목우선호가
	`char 매수3단계우선호가잔량[12];	// 매수3단계우선호가잔량, 종목우선호가
	`char 매수4단계우선호가가격[11];	// 매수4단계우선호가가격, 종목우선호가
	`char 매수4단계우선호가잔량[12];	// 매수4단계우선호가잔량, 종목우선호가
	`char 매수5단계우선호가가격[11];	// 매수5단계우선호가가격, 종목우선호가
	`char 매수5단계우선호가잔량[12];	// 매수5단계우선호가잔량, 종목우선호가
	`char 매도1단계우선호가거래금액[22];	// 매도1단계우선호가거래금액, 금액표현:상품개발가이드참조. 종목우선호가.개발가이드참조
	`char 매도2단계우선호가거래금액[22];	// 매도2단계우선호가거래금액, 종목우선호가
	`char 매도3단계우선호가거래금액[22];	// 매도3단계우선호가거래금액, 종목우선호가
	`char 매도4단계우선호가거래금액[22];	// 매도4단계우선호가거래금액, 종목우선호가
	`char 매도5단계우선호가거래금액[22];	// 매도5단계우선호가거래금액, 종목우선호가
	`char 종류매도호가총잔량[12];	// 종류매도호가총잔량
	`char 종류매수호가총잔량[12];	// 종류매수호가총잔량
	`char 지정매수1단계우선호가가격[11];	// 지정매수1단계우선호가가격, 개발가이드 참조
	`char 지정매수1단계REPO우선호가잔량[12];	// 지정매수1단계REPO우선호가잔량
	`char 지정매수1단계우선호가종목코드[12];	// 지정매수1단계우선호가종목코드
	`char 지정매수2단계우선호가가격[11];	// 지정매수2단계우선호가가격
	`char 지정매수2단계REPO우선호가잔량[12];	// 지정매수2단계REPO우선호가잔량
	`char 지정매수2단계우선호가종목코드[12];	// 지정매수2단계우선호가종목코드
	`char 지정매수3단계우선호가가격[11];	// 지정매수3단계우선호가가격
	`char 지정매수3단계REPO우선호가잔량[12];	// 지정매수3단계REPO우선호가잔량
	`char 지정매수3단계우선호가종목코드[12];	// 지정매수3단계우선호가종목코드
	`char 지정매수4단계우선호가가격[11];	// 지정매수4단계우선호가가격
	`char 지정매수4단계REPO우선호가잔량[12];	// 지정매수4단계REPO우선호가잔량
	`char 지정매수4단계우선호가종목코드[12];	// 지정매수4단계우선호가종목코드
	`char 지정매수5단계우선호가가격[11];	// 지정매수5단계우선호가가격
	`char 지정매수5단계REPO우선호가잔량[12];	// 지정매수5단계REPO우선호가잔량
	`char 지정매수5단계우선호가종목코드[12];	// 지정매수5단계우선호가종목코드
	`char 지정매수6단계우선호가가격[11];	// 지정매수6단계우선호가가격
	`char 지정매수6단계REPO우선호가잔량[12];	// 지정매수6단계REPO우선호가잔량
	`char 지정매수6단계우선호가종목코드[12];	// 지정매수6단계우선호가종목코드
	`char 지정매수7단계우선호가가격[11];	// 지정매수7단계우선호가가격
	`char 지정매수7단계REPO우선호가잔량[12];	// 지정매수7단계REPO우선호가잔량
	`char 지정매수7단계우선호가종목코드[12];	// 지정매수7단계우선호가종목코드
	`char 지정매수8단계우선호가가격[11];	// 지정매수8단계우선호가가격
	`char 지정매수8단계REPO우선호가잔량[12];	// 지정매수8단계REPO우선호가잔량
	`char 지정매수8단계우선호가종목코드[12];	// 지정매수8단계우선호가종목코드
	`char 지정매수9단계우선호가가격[11];	// 지정매수9단계우선호가가격
	`char 지정매수9단계REPO우선호가잔량[12];	// 지정매수9단계REPO우선호가잔량
	`char 지정매수9단계우선호가종목코드[12];	// 지정매수9단계우선호가종목코드
	`char 지정매수10단계우선호가가격[11];	// 지정매수10단계우선호가가격
	`char 지정매수10단계REPO우선호가잔량[12];	// 지정매수10단계REPO우선호가잔량
	`char 지정매수10단계우선호가종목코드[12];	// 지정매수10단계우선호가종목코드
	`char 전체매수1단계우선호가가격[11];	// 전체매수1단계우선호가가격, 종류우선(종목+종류).개발가이드 참조
	`char 전체매수1단계우선호가잔량[12];	// 전체매수1단계우선호가잔량, 종류우선(종목+종류)
	`char 매수1단계GC포함여부[1];	// 매수1단계GC포함여부, 종류우선(종목+종류)
	`char 전체매수2단계우선호가가격[11];	// 전체매수2단계우선호가가격, 종류우선(종목+종류)
	`char 전체매수2단계우선호가잔량[12];	// 전체매수2단계우선호가잔량, 종류우선(종목+종류)
	`char 매수2단계GC포함여부[1];	// 매수2단계GC포함여부, 종류우선(종목+종류)
	`char 전체매수3단계우선호가가격[11];	// 전체매수3단계우선호가가격, 종류우선(종목+종류)
	`char 전체매수3단계우선호가잔량[12];	// 전체매수3단계우선호가잔량, 종류우선(종목+종류)
	`char 매수3단계GC포함여부[1];	// 매수3단계GC포함여부, 종류우선(종목+종류)
	`char 전체매수4단계우선호가가격[11];	// 전체매수4단계우선호가가격, 종류우선(종목+종류)
	`char 전체매수4단계우선호가잔량[12];	// 전체매수4단계우선호가잔량, 종류우선(종목+종류)
	`char 매수4단계GC포함여부[1];	// 매수4단계GC포함여부, 종류우선(종목+종류)
	`char 전체매수5단계우선호가가격[11];	// 전체매수5단계우선호가가격, 종류우선(종목+종류)
	`char 전체매수5단계우선호가잔량[12];	// 전체매수5단계우선호가잔량, 종류우선(종목+종류)
	`char 매수5단계GC포함여부[1];	// 매수5단계GC포함여부, 종류우선(종목+종류)
	`char 종류매도1단계우선호가가격[11];	// 종류매도1단계우선호가가격, 종류우선(종목합).개발가이드 첨조
	`char 종류매도1단계우선호가잔량합계[12];	// 종류매도1단계우선호가잔량합계, 종류우선(종목합)
	`char 종류매도2단계우선호가가격[11];	// 종류매도2단계우선호가가격, 종류우선(종목합)
	`char 종류매도2단계우선호가잔량합계[12];	// 종류매도2단계우선호가잔량합계, 종류우선(종목합)
	`char 종류매도3단계우선호가가격[11];	// 종류매도3단계우선호가가격, 종류우선(종목합)
	`char 종류매도3단계우선호가잔량합계[12];	// 종류매도3단계우선호가잔량합계, 종류우선(종목합)
	`char 종류매도4단계우선호가가격[11];	// 종류매도4단계우선호가가격, 종류우선(종목합)
	`char 종류매도4단계우선호가잔량합계[12];	// 종류매도4단계우선호가잔량합계, 종류우선(종목합)
	`char 종류매도5단계우선호가가격[11];	// 종류매도5단계우선호가가격, 종류우선(종목합)
	`char 종류매도5단계우선호가잔량합계[12];	// 종류매도5단계우선호가잔량합계, 종류우선(종목합)
	`char 종류매수1단계우선호가가격[11];	// 종류매수1단계우선호가가격, 종류우선(종류순수분).개발가이드 첨조
	`char 종류매수1단계우선호가잔량[12];	// 종류매수1단계우선호가잔량, 종류우선(종류순수분)
	`char 종류매수2단계우선호가가격[11];	// 종류매수2단계우선호가가격, 종류우선(종류순수분)
	`char 종류매수2단계우선호가잔량[12];	// 종류매수2단계우선호가잔량, 종류우선(종류순수분)
	`char 종류매수3단계우선호가가격[11];	// 종류매수3단계우선호가가격, 종류우선(종류순수분)
	`char 종류매수3단계우선호가잔량[12];	// 종류매수3단계우선호가잔량, 종류우선(종류순수분)
	`char 종류매수4단계우선호가가격[11];	// 종류매수4단계우선호가가격, 종류우선(종류순수분)
	`char 종류매수4단계우선호가잔량[12];	// 종류매수4단계우선호가잔량, 종류우선(종류순수분)
	`char 종류매수5단계우선호가가격[11];	// 종류매수5단계우선호가가격, 종류우선(종류순수분)
	`char 종류매수5단계우선호가잔량[12];	// 종류매수5단계우선호가잔량, 종류우선(종류순수분)
	`char 종류매도1단계우선호가거래금액[22];	// 종류매도1단계우선호가거래금액, 종류우선(종목합).개발가이드 첨조
	`char 종류매도2단계우선호가거래금액[22];	// 종류매도2단계우선호가거래금액, 종류우선(종목합)
	`char 종류매도3단계우선호가거래금액[22];	// 종류매도3단계우선호가거래금액, 종류우선(종목합)
	`char 종류매도4단계우선호가거래금액[22];	// 종류매도4단계우선호가거래금액, 종류우선(종목합)
	`char 종류매도5단계우선호가거래금액[22];	// 종류매도5단계우선호가거래금액, 종류우선(종목합)
	`char 지정매수최우선호가가격[11];	// 지정매수최우선호가가격, 종류우선(종목합)
	`char 순수종류매수호가총잔량[12];	// 순수종류매수호가총잔량
	char filler[5];	// FILLER
	char ff[1];	// FF, END OF TEXT (0xFF)
} 구조체명정의필요;


// 환매조건부채권(REPO) 체결
typedef struct _구조체명정의필요 {
	char data_clsf[2];	// DATA구분, A3
	char info_clsf[2];	// 정보구분, 05:환매조건부채권(REPO)
	char mkt_clsf[1];	// 시장구분, 7:채권
	char isin_code[12];	// 종목코드
	char brd_id[2];	// 보드ID, 코드값모음 참조
	char ccls_time[9];	// 체결시각
	char ccls_prc[11];	// 체결가격, REPO 가격표현:상품개발가이드참조
	char ccls_qty[10];	// 체결수량, 수량단위:천원
	char sess_id[2];	// 세션ID, 코드값모음 참조
	char ccls_date[8];	// 체결일자, YYYYMMDD
	char trd_val[22];	// 거래대금, 단위:원
	`char 매도REPO분류코드[2];	// 매도REPO분류코드
	`char 매도REPO기간[4];	// 매도REPO기간
	`char 매수REPO분류코드[2];	// 매수REPO분류코드
	`char 매수REPO기간[4];	// 매수REPO기간
	char open[11];	// 시가, REPO 가격표현:상품개발가이드참조
	char high[11];	// 고가, REPO 가격표현:상품개발가이드참조
	char low[11];	// 저가, REPO 가격표현:상품개발가이드참조
	`char 종류시가[11];	// 종류시가, REPO 가격표현:상품개발가이드참조
	`char 종류고가[11];	// 종류고가, REPO 가격표현:상품개발가이드참조
	`char 종류저가[11];	// 종류저가, REPO 가격표현:상품개발가이드참조
	char cum_ccls_qty[12];	// 누적체결수량, 수량단위:천원
	char cum_trd_val[22];	// 누적거래대금, 단위:원, 대금표현:상품개발가이드참조
	`char 종류누적거래량[12];	// 종류누적거래량, 수량단위:천원
	`char 종류누적거래대금[22];	// 종류누적거래대금, 단위:원, 대금표현:상품개발가이드참조
	char filler[2];	// FILLER, SPACE
	char ff[1];	// FF, END OF TEXT (0xFF)
} 구조체명정의필요;


// 환매조건부채권(REPO) 체결_우선호가
typedef struct _구조체명정의필요 {
	char data_clsf[2];	// DATA구분, G7
	char info_clsf[2];	// 정보구분, 05:환매조건부채권(REPO)
	char mkt_clsf[1];	// 시장구분, 7:채권
	char isin_code[12];	// 종목코드
	char brd_id[2];	// 보드ID, 코드값모음 참조
	char ccls_time[9];	// 체결시각
	char ccls_prc[11];	// 체결가격, REPO 가격표현:상품개발가이드참조
	char ccls_qty[10];	// 체결수량, 수량단위:천원
	char sess_id[2];	// 세션ID, 코드값모음 참조
	char ccls_date[8];	// 체결일자, YYYYMMDD
	char trd_val[22];	// 거래대금, 단위:원
	`char 매도REPO분류코드[2];	// 매도REPO분류코드
	`char 매도REPO기간[4];	// 매도REPO기간
	`char 매수REPO분류코드[2];	// 매수REPO분류코드
	`char 매수REPO기간[4];	// 매수REPO기간
	char open[11];	// 시가, REPO 가격표현:상품개발가이드참조
	char high[11];	// 고가, REPO 가격표현:상품개발가이드참조
	char low[11];	// 저가, REPO 가격표현:상품개발가이드참조
	`char 종류시가[11];	// 종류시가, REPO 가격표현:상품개발가이드참조
	`char 종류고가[11];	// 종류고가, REPO 가격표현:상품개발가이드참조
	`char 종류저가[11];	// 종류저가, REPO 가격표현:상품개발가이드참조
	char cum_ccls_qty[12];	// 누적체결수량, 수량단위:천원
	char cum_trd_val[22];	// 누적거래대금, 단위:원, 대금표현:상품개발가이드참조
	`char 종류누적거래량[12];	// 종류누적거래량, 수량단위:천원
	`char 종류누적거래대금[22];	// 종류누적거래대금, 단위:원, 대금표현:상품개발가이드참조
	`char 매도호가총잔량[12];	// 매도호가총잔량, 수량단위:천원
	`char 매수호가총잔량[12];	// 매수호가총잔량, 수량단위:천원
	`char 매도1단계우선호가가격[11];	// 매도1단계우선호가가격, REPO 가격표현:상품개발가이드참조.. 종목우선호가
	`char 매도1단계우선호가잔량[12];	// 매도1단계우선호가잔량, 종목우선호가
	`char 매도2단계우선호가가격[11];	// 매도2단계우선호가가격, 종목우선호가
	`char 매도2단계우선호가잔량[12];	// 매도2단계우선호가잔량, 종목우선호가
	`char 매도3단계우선호가가격[11];	// 매도3단계우선호가가격, 종목우선호가
	`char 매도3단계우선호가잔량[12];	// 매도3단계우선호가잔량, 종목우선호가
	`char 매도4단계우선호가가격[11];	// 매도4단계우선호가가격, 종목우선호가
	`char 매도4단계우선호가잔량[12];	// 매도4단계우선호가잔량, 종목우선호가
	`char 매도5단계우선호가가격[11];	// 매도5단계우선호가가격, 종목우선호가
	`char 매도5단계우선호가잔량[12];	// 매도5단계우선호가잔량, 종목우선호가
	`char 매수1단계우선호가가격[11];	// 매수1단계우선호가가격, 종목우선호가
	`char 매수1단계우선호가잔량[12];	// 매수1단계우선호가잔량, 종목우선호가
	`char 매수2단계우선호가가격[11];	// 매수2단계우선호가가격, 종목우선호가
	`char 매수2단계우선호가잔량[12];	// 매수2단계우선호가잔량, 종목우선호가
	`char 매수3단계우선호가가격[11];	// 매수3단계우선호가가격, 종목우선호가
	`char 매수3단계우선호가잔량[12];	// 매수3단계우선호가잔량, 종목우선호가
	`char 매수4단계우선호가가격[11];	// 매수4단계우선호가가격, 종목우선호가
	`char 매수4단계우선호가잔량[12];	// 매수4단계우선호가잔량, 종목우선호가
	`char 매수5단계우선호가가격[11];	// 매수5단계우선호가가격, 종목우선호가
	`char 매수5단계우선호가잔량[12];	// 매수5단계우선호가잔량, 종목우선호가
	`char 매도1단계우선호가거래금액[22];	// 매도1단계우선호가거래금액, 금액표현:상품개발가이드참조. 종목우선호가.개발가이드참조
	`char 매도2단계우선호가거래금액[22];	// 매도2단계우선호가거래금액, 종목우선호가
	`char 매도3단계우선호가거래금액[22];	// 매도3단계우선호가거래금액, 종목우선호가
	`char 매도4단계우선호가거래금액[22];	// 매도4단계우선호가거래금액, 종목우선호가
	`char 매도5단계우선호가거래금액[22];	// 매도5단계우선호가거래금액, 종목우선호가
	`char 종류매도호가총잔량[12];	// 종류매도호가총잔량
	`char 종류매수호가총잔량[12];	// 종류매수호가총잔량
	`char 지정매수1단계우선호가가격[11];	// 지정매수1단계우선호가가격, 개발가이드 참조
	`char 지정매수1단계REPO우선호가잔량[12];	// 지정매수1단계REPO우선호가잔량
	`char 지정매수1단계우선호가종목코드[12];	// 지정매수1단계우선호가종목코드
	`char 지정매수2단계우선호가가격[11];	// 지정매수2단계우선호가가격
	`char 지정매수2단계REPO우선호가잔량[12];	// 지정매수2단계REPO우선호가잔량
	`char 지정매수2단계우선호가종목코드[12];	// 지정매수2단계우선호가종목코드
	`char 지정매수3단계우선호가가격[11];	// 지정매수3단계우선호가가격
	`char 지정매수3단계REPO우선호가잔량[12];	// 지정매수3단계REPO우선호가잔량
	`char 지정매수3단계우선호가종목코드[12];	// 지정매수3단계우선호가종목코드
	`char 지정매수4단계우선호가가격[11];	// 지정매수4단계우선호가가격
	`char 지정매수4단계REPO우선호가잔량[12];	// 지정매수4단계REPO우선호가잔량
	`char 지정매수4단계우선호가종목코드[12];	// 지정매수4단계우선호가종목코드
	`char 지정매수5단계우선호가가격[11];	// 지정매수5단계우선호가가격
	`char 지정매수5단계REPO우선호가잔량[12];	// 지정매수5단계REPO우선호가잔량
	`char 지정매수5단계우선호가종목코드[12];	// 지정매수5단계우선호가종목코드
	`char 지정매수6단계우선호가가격[11];	// 지정매수6단계우선호가가격
	`char 지정매수6단계REPO우선호가잔량[12];	// 지정매수6단계REPO우선호가잔량
	`char 지정매수6단계우선호가종목코드[12];	// 지정매수6단계우선호가종목코드
	`char 지정매수7단계우선호가가격[11];	// 지정매수7단계우선호가가격
	`char 지정매수7단계REPO우선호가잔량[12];	// 지정매수7단계REPO우선호가잔량
	`char 지정매수7단계우선호가종목코드[12];	// 지정매수7단계우선호가종목코드
	`char 지정매수8단계우선호가가격[11];	// 지정매수8단계우선호가가격
	`char 지정매수8단계REPO우선호가잔량[12];	// 지정매수8단계REPO우선호가잔량
	`char 지정매수8단계우선호가종목코드[12];	// 지정매수8단계우선호가종목코드
	`char 지정매수9단계우선호가가격[11];	// 지정매수9단계우선호가가격
	`char 지정매수9단계REPO우선호가잔량[12];	// 지정매수9단계REPO우선호가잔량
	`char 지정매수9단계우선호가종목코드[12];	// 지정매수9단계우선호가종목코드
	`char 지정매수10단계우선호가가격[11];	// 지정매수10단계우선호가가격
	`char 지정매수10단계REPO우선호가잔량[12];	// 지정매수10단계REPO우선호가잔량
	`char 지정매수10단계우선호가종목코드[12];	// 지정매수10단계우선호가종목코드
	`char 전체매수1단계우선호가가격[11];	// 전체매수1단계우선호가가격, 종류우선(종목+종류).개발가이드 참조
	`char 전체매수1단계우선호가잔량[12];	// 전체매수1단계우선호가잔량, 종류우선(종목+종류)
	`char 매수1단계GC포함여부[1];	// 매수1단계GC포함여부, 종류우선(종목+종류)
	`char 전체매수2단계우선호가가격[11];	// 전체매수2단계우선호가가격, 종류우선(종목+종류)
	`char 전체매수2단계우선호가잔량[12];	// 전체매수2단계우선호가잔량, 종류우선(종목+종류)
	`char 매수2단계GC포함여부[1];	// 매수2단계GC포함여부, 종류우선(종목+종류)
	`char 전체매수3단계우선호가가격[11];	// 전체매수3단계우선호가가격, 종류우선(종목+종류)
	`char 전체매수3단계우선호가잔량[12];	// 전체매수3단계우선호가잔량, 종류우선(종목+종류)
	`char 매수3단계GC포함여부[1];	// 매수3단계GC포함여부, 종류우선(종목+종류)
	`char 전체매수4단계우선호가가격[11];	// 전체매수4단계우선호가가격, 종류우선(종목+종류)
	`char 전체매수4단계우선호가잔량[12];	// 전체매수4단계우선호가잔량, 종류우선(종목+종류)
	`char 매수4단계GC포함여부[1];	// 매수4단계GC포함여부, 종류우선(종목+종류)
	`char 전체매수5단계우선호가가격[11];	// 전체매수5단계우선호가가격, 종류우선(종목+종류)
	`char 전체매수5단계우선호가잔량[12];	// 전체매수5단계우선호가잔량, 종류우선(종목+종류)
	`char 매수5단계GC포함여부[1];	// 매수5단계GC포함여부, 종류우선(종목+종류)
	`char 종류매도1단계우선호가가격[11];	// 종류매도1단계우선호가가격, 종류우선(종목합).개발가이드 첨조
	`char 종류매도1단계우선호가잔량합계[12];	// 종류매도1단계우선호가잔량합계, 종류우선(종목합)
	`char 종류매도2단계우선호가가격[11];	// 종류매도2단계우선호가가격, 종류우선(종목합)
	`char 종류매도2단계우선호가잔량합계[12];	// 종류매도2단계우선호가잔량합계, 종류우선(종목합)
	`char 종류매도3단계우선호가가격[11];	// 종류매도3단계우선호가가격, 종류우선(종목합)
	`char 종류매도3단계우선호가잔량합계[12];	// 종류매도3단계우선호가잔량합계, 종류우선(종목합)
	`char 종류매도4단계우선호가가격[11];	// 종류매도4단계우선호가가격, 종류우선(종목합)
	`char 종류매도4단계우선호가잔량합계[12];	// 종류매도4단계우선호가잔량합계, 종류우선(종목합)
	`char 종류매도5단계우선호가가격[11];	// 종류매도5단계우선호가가격, 종류우선(종목합)
	`char 종류매도5단계우선호가잔량합계[12];	// 종류매도5단계우선호가잔량합계, 종류우선(종목합)
	`char 종류매수1단계우선호가가격[11];	// 종류매수1단계우선호가가격, 종류우선(종류순수분).개발가이드 첨조
	`char 종류매수1단계우선호가잔량[12];	// 종류매수1단계우선호가잔량, 종류우선(종류순수분)
	`char 종류매수2단계우선호가가격[11];	// 종류매수2단계우선호가가격, 종류우선(종류순수분)
	`char 종류매수2단계우선호가잔량[12];	// 종류매수2단계우선호가잔량, 종류우선(종류순수분)
	`char 종류매수3단계우선호가가격[11];	// 종류매수3단계우선호가가격, 종류우선(종류순수분)
	`char 종류매수3단계우선호가잔량[12];	// 종류매수3단계우선호가잔량, 종류우선(종류순수분)
	`char 종류매수4단계우선호가가격[11];	// 종류매수4단계우선호가가격, 종류우선(종류순수분)
	`char 종류매수4단계우선호가잔량[12];	// 종류매수4단계우선호가잔량, 종류우선(종류순수분)
	`char 종류매수5단계우선호가가격[11];	// 종류매수5단계우선호가가격, 종류우선(종류순수분)
	`char 종류매수5단계우선호가잔량[12];	// 종류매수5단계우선호가잔량, 종류우선(종류순수분)
	`char 종류매도1단계우선호가거래금액[22];	// 종류매도1단계우선호가거래금액, 종류우선(종목합).개발가이드 첨조
	`char 종류매도2단계우선호가거래금액[22];	// 종류매도2단계우선호가거래금액, 종류우선(종목합)
	`char 종류매도3단계우선호가거래금액[22];	// 종류매도3단계우선호가거래금액, 종류우선(종목합)
	`char 종류매도4단계우선호가거래금액[22];	// 종류매도4단계우선호가거래금액, 종류우선(종목합)
	`char 종류매도5단계우선호가거래금액[22];	// 종류매도5단계우선호가거래금액, 종류우선(종목합)
	`char 지정매수최우선호가가격[11];	// 지정매수최우선호가가격, 종류우선(종목합)
	`char 순수종류매수호가총잔량[12];	// 순수종류매수호가총잔량
	char filler[1];	// FILLER
	char ff[1];	// FF, END OF TEXT (0xFF)
} 구조체명정의필요;


// 환매조건부채권(REPO) 종목마감
typedef struct _구조체명정의필요 {
	char data_clsf[2];	// DATA구분, A6
	char info_clsf[2];	// 정보구분, 05:환매조건부채권(REPO)
	char mkt_clsf[1];	// 시장구분, 7:채권
	char isin_code[12];	// 종목코드
	char brd_id[2];	// 보드ID, 코드값모음 참조
	`char REPO기간[4];	// REPO기간
	`char 종목마감종가[11];	// 종목마감종가, 단위:원, 가격표현:상품개발가이드참조
	`char 종목마감수익률[13];	// 종목마감수익률, 상품개발가이드참조
	`char 종목마감가격구분코드[1];	// 종목마감가격구분코드, 1 체결가격\n 2 기세\n 3 거래무 (당일 거래무종목은 종목마감 전송되지 않음)\n 4 시가기준가종목의 기세\n 정규장이 아닌 경우 SPACE
	char filler[1];	// FILLER
	char ff[1];	// FF, END OF TEXT (0xFF)
} 구조체명정의필요;


// 환매조건부채권(REPO) 장운영스케줄공개
typedef struct _구조체명정의필요 {
	char data_clsf[2];	// DATA구분, M4
	char info_clsf[2];	// 정보구분, 05:환매조건부채권(REPO)
	char mkt_clsf[1];	// 시장구분, 7:채권
	char isin_code[12];	// 종목코드
	char brd_id[2];	// 보드ID, ※ 코드값모음 참조
	char brd_evt_id[3];	// 보드이벤트ID, ※ 코드값모음 참조
	char brd_evt_st[9];	// 보드이벤트시작시각
	char brd_evt_code[5];	// 보드이벤트적용군코드, ※ 코드값모음 참조
	`char 세션개시종료코드[2];	// 세션개시종료코드, BS: 보드개시\n BE: 보드종료\n SS: 세션개시\n SE: 세션종료\n SH: 세션정지\n SR: 세션재개
	char sess_id[2];	// 세션ID, ※ 코드값모음 참조
	`char 상장사종목코드[12];	// 상장사종목코드, 종목조치의 기준이 되는 종목코드\n *비상장사의 종목코드도 사용될 수 있음
	`char 거래정지사유코드[3];	// 거래정지사유코드, ※ 코드값모음 참조
	`char 거래정지발생유형코드[1];	// 거래정지발생유형코드, 1: 자기종목 2: 신주인수권증권 3: 신주인수권증서 4: 기초자산ELW\n 5: 발행ELW 6: 상장사 7: 기초자산소
	char filler[3];	// FILLER, SPACE
	char ff[1];	// FF, END OF TEXT (0xFF)
} 구조체명정의필요;


// 환매조건부채권(REPO) 채권종목정보공개
typedef struct _구조체명정의필요 {
	char data_clsf[2];	// DATA구분, A8
	char info_clsf[2];	// 정보구분, 05:환매조건부채권(REPO)
	char mkt_clsf[1];	// 시장구분, 7:채권
	char isin_code[12];	// 종목코드
	`char 공개정보구분코드[3];	// 공개정보구분코드, 코드값모음 참조
	char brd_id[2];	// 보드ID, 코드값모음 참조
	`char 공개시각[9];	// 공개시각, 공개시각
	`char 이자지급방법코드[2];	// 이자지급방법코드, 고정금리형(11:할인채,12:복리채, 13:이표채, 14:단리채,15:복5단2, 19:기타) 변동금리형(21:이표채, 22:복리채, 23:단리채, 29:기타)
	`char 발행일자[8];	// 발행일자, 발행일자
	`char 상환일자[8];	// 상환일자, 상환일자
	`char 매출일자[8];	// 매출일자, 선매출채권중 원천징수를 하지 않는 은행체등의 경우에만 표기(소액국공채 등은 표기치 않음)
	`char 채권발행율[13];	// 채권발행율, 채권발행율 및 발행가액의 의미를 가짐
	`char 표면이자율[14];	// 표면이자율, 표면이자율
	`char 이자지급계산월수[4];	// 이자지급계산월수, 0:불규칙,0<이자지급계산월수: 규칙의 경우 개월수(이표채,복리채,나머지는 표기하지 않음)
	`char 이자일지급기준구분코드[1];	// 이자일지급기준구분코드, 1:발행일, 2:상환일(채권부 입력사항)
	`char 이자월말구분코드[1];	// 이자월말구분코드, 1:일자기준,2: 말일기준(채권부 입력사항)
	`char 이자원단위미만처리코드[1];	// 이자원단위미만처리코드, 1:절사, 2:절상, 3:사사오입, 4:원미만인정
	`char 채권선매출이자지급방법코드[1];	// 채권선매출이자지급방법코드, 1:매출시,2: 최초 이자지급시, 3:상환시, 4:매출시(국고채유형) ==>'매출형태'가 선매출(1)인 경우에만 사용
	`char 통화구분코드[1];	// 통화구분코드, 1:원화(default), 2:US$, 3:엔, 4:유로화
	`char 만기상환비율[13];	// 만기상환비율, 만기에 상환하는 비율(주로 주식관련사채권의 경우에 많음)
	`char 보장수익률[13];	// 보장수익률, 만기에 발행사에서 보장하는 만기보장 수익률(예:8%등)
	`char 거치개월수[4];	// 거치개월수, 개월수로 입력 ('분할상환구분'이 원금균등, 원리금균등의 경우 사용)
	`char 분할상환횟수[5];	// 분할상환횟수, 분할 상환횟수 표시 ('분할상환구분'이 원금균등, 원리금균등의 경우 사용)
	`char 가산금리[10];	// 가산금리, 가산금리 또는 차감금리 (음수인 경우는 '-' 부호 포함됨)
	`char 당일기준가격[10];	// 당일기준가격, 당일의 기준가격
	`char 은행휴무일이자지급결정코드[1];	// 은행휴무일이자지급결정코드, 1:직전영업일?(직후영업일에 지급시 경과이자 없음)\n 2:직전영업일?(직후영업일에 지급시 경과이자 있음)\n 3:직후영업일 (경과이자 없음)\n 4:직후영업일 (경과이자 있음)\n 5:해당사항 없음
	`char 영구채권만기구조여부[1];	// 영구채권만기구조여부, Y:하이브리드채권 해당 N:미해당'
	`char 표면이자율결정기준금리코드[2];	// 표면이자율결정기준금리코드, 코드 내용은 별도 참조
	`char 이자율결정기준일자[8];	// 이자율결정기준일자, 최초이자에 적용되는 기준금리 적용일자\n (국고채 FRN 해당)
	`char 정리매매여부[1];	// 정리매매여부, Y:정리매매대상 N:정리매매비대상
	char filler[8];	// FILLER
	char ff[1];	// FF, END OF TEXT (0xFF)
} 구조체명정의필요;


// 환매조건부채권(REPO) 회원제재해제
typedef struct _구조체명정의필요 {
	char data_clsf[2];	// DATA구분, R3
	char info_clsf[2];	// 정보구분, 05:환매조건부채권(REPO)
	char mkt_clsf[1];	// 시장구분, 7:채권
	char isin_code[12];	// 종목코드, **: 전종목해당
	`char 공개정보구분코드[3];	// 공개정보구분코드, 711 회원매매거래정지\n 712 회원매매거래해제
	`char 공개시각[9];	// 공개시각, 공개시각
	`char 회원번호[5];	// 회원번호, 회원번호
	`char 회원제재범위구분코드[5];	// 회원제재범위구분코드, 회원의 거래를 허용 또는 제재하는 범위. BITWISE 정의\n 1: 매도(풋매수) 위탁\n 2: 매도(풋매수) 자기\n 4: 매수(풋매도) 위탁\n 8: 매수(풋매도) 자기\n 15:범위구분 전체
	char filler[10];	// FILLER
	char ff[1];	// FF, END OF TEXT (0xFF)
} 구조체명정의필요;


// 일반채권 우선호가
typedef struct _구조체명정의필요 {
	char data_clsf[2];	// DATA구분, B6
	char info_clsf[2];	// 정보구분, 06:장내일반채권
	char mkt_clsf[1];	// 시장구분, 7:채권
	char isin_code[12];	// 종목코드, 종목코드
	char brd_id[2];	// 보드ID, 코드값모음 참조
	`char 매수총호가잔량[12];	// 매수총호가잔량, 수량단위:천원
	`char 매수1단계우선호가가격[11];	// 매수1단계우선호가가격, 99999999.99
	`char 매수1단계우선호가잔량[12];	// 매수1단계우선호가잔량, 수량단위:천원
	`char 매수1단계우선호가수익률[13];	// 매수1단계우선호가수익률, 수익율표현:상품개발가이드참조
	`char 매수2단계우선호가가격[11];	// 매수2단계우선호가가격, 99999999.99
	`char 매수2단계우선호가잔량[12];	// 매수2단계우선호가잔량, 수량단위:천원
	`char 매수2단계우선호가수익률[13];	// 매수2단계우선호가수익률, 수익율표현:상품개발가이드참조
	`char 매수3단계우선호가가격[11];	// 매수3단계우선호가가격, 99999999.99
	`char 매수3단계우선호가잔량[12];	// 매수3단계우선호가잔량, 수량단위:천원
	`char 매수3단계우선호가수익률[13];	// 매수3단계우선호가수익률, 수익율표현:상품개발가이드참조
	`char 매수4단계우선호가가격[11];	// 매수4단계우선호가가격, 99999999.99
	`char 매수4단계우선호가잔량[12];	// 매수4단계우선호가잔량, 수량단위:천원
	`char 매수4단계우선호가수익률[13];	// 매수4단계우선호가수익률, 수익율표현:상품개발가이드참조
	`char 매수5단계우선호가가격[11];	// 매수5단계우선호가가격, 99999999.99
	`char 매수5단계우선호가잔량[12];	// 매수5단계우선호가잔량, 수량단위:천원
	`char 매수5단계우선호가수익률[13];	// 매수5단계우선호가수익률, 수익율표현:상품개발가이드참조
	`char 매도총호가잔량[12];	// 매도총호가잔량, 수량단위:천원
	`char 매도1단계우선호가가격[11];	// 매도1단계우선호가가격, 99999999.99
	`char 매도1단계우선호가잔량[12];	// 매도1단계우선호가잔량, 수량단위:천원
	`char 매도1단계우선호가수익률[13];	// 매도1단계우선호가수익률, 수익율표현:상품개발가이드참조
	`char 매도2단계우선호가가격[11];	// 매도2단계우선호가가격, 99999999.99
	`char 매도2단계우선호가잔량[12];	// 매도2단계우선호가잔량, 수량단위:천원
	`char 매도2단계우선호가수익률[13];	// 매도2단계우선호가수익률, 수익율표현:상품개발가이드참조
	`char 매도3단계우선호가가격[11];	// 매도3단계우선호가가격, 99999999.99
	`char 매도3단계우선호가잔량[12];	// 매도3단계우선호가잔량, 수량단위:천원
	`char 매도3단계우선호가수익률[13];	// 매도3단계우선호가수익률, 수익율표현:상품개발가이드참조
	`char 매도4단계우선호가가격[11];	// 매도4단계우선호가가격, 99999999.99
	`char 매도4단계우선호가잔량[12];	// 매도4단계우선호가잔량, 수량단위:천원
	`char 매도4단계우선호가수익률[13];	// 매도4단계우선호가수익률, 수익율표현:상품개발가이드참조
	`char 매도5단계우선호가가격[11];	// 매도5단계우선호가가격, 99999999.99
	`char 매도5단계우선호가잔량[12];	// 매도5단계우선호가잔량, 수량단위:천원
	`char 매도5단계우선호가수익률[13];	// 매도5단계우선호가수익률, 수익율표현:상품개발가이드참조
	char filler[6];	// FILLER
	char ff[1];	// FF, END OF TEXT (0xFF)
} 구조체명정의필요;


// 일반채권 체결
typedef struct _구조체명정의필요 {
	char data_clsf[2];	// DATA구분, A3
	char info_clsf[2];	// 정보구분, 06:장내일반채권
	char mkt_clsf[1];	// 시장구분, 7:채권
	char isin_code[12];	// 종목코드
	char brd_id[2];	// 보드ID, 코드값모음 참조
	char ccls_time[9];	// 체결시각
	char ccls_prc[11];	// 체결가격, 99999999.99\n 매도 매수 호가간의 거래성사된 가격\n 경쟁대량매매인 경우 0 (경쟁대량VWAP은 체결가격 있음)
	char ccls_qty[10];	// 체결수량, 수량단위:천원
	char sess_id[2];	// 세션ID, 코드값모음 참조
	char ccls_date[8];	// 체결일자, YYYYMMDD
	char trd_val[22];	// 거래대금, 단위:원
	`char 체결수익률[13];	// 체결수익률, 수익율표현:상품개발가이드참조
	char open[11];	// 시가, 99999999.99
	char high[11];	// 고가, 99999999.99
	char low[11];	// 저가, 99999999.99
	`char 시가수익률[13];	// 시가수익률, 수익율표현:상품개발가이드참조
	`char 고가수익률[13];	// 고가수익률, 수익율표현:상품개발가이드참조
	`char 저가수익률[13];	// 저가수익률, 수익율표현:상품개발가이드참조
	char cum_ccls_qty[12];	// 누적체결수량, 수량단위:천원
	char cum_trd_val[22];	// 누적거래대금, 단위:원, 대금표현:상품개발가이드참조
	`char 결제일자[8];	// 결제일자, YYYYMMDD
	char filler[1];	// FILLER, SPACE
	char ff[1];	// FF, END OF TEXT (0xFF)
} 구조체명정의필요;


// 일반채권 체결_우선호가
typedef struct _구조체명정의필요 {
	char data_clsf[2];	// DATA구분, G7
	char info_clsf[2];	// 정보구분, 06:장내일반채권
	char mkt_clsf[1];	// 시장구분, 7:채권
	char isin_code[12];	// 종목코드
	char brd_id[2];	// 보드ID, 코드값모음 참조
	char ccls_time[9];	// 체결시각
	char ccls_prc[11];	// 체결가격, 99999999.99\n 매도 매수 호가간의 거래성사된 가격\n 경쟁대량매매인 경우 0 (경쟁대량VWAP은 체결가격 있음)
	char ccls_qty[10];	// 체결수량, 수량단위:천원
	char sess_id[2];	// 세션ID, 코드값모음 참조
	char ccls_date[8];	// 체결일자, YYYYMMDD
	char trd_val[22];	// 거래대금, 단위:원
	`char 체결수익률[13];	// 체결수익률
	char open[11];	// 시가, 99999999.99
	char high[11];	// 고가, 99999999.99
	char low[11];	// 저가, 99999999.99
	`char 시가수익률[13];	// 시가수익률, 수익율표현:상품개발가이드참조
	`char 고가수익률[13];	// 고가수익률, 수익율표현:상품개발가이드참조
	`char 저가수익률[13];	// 저가수익률, 수익율표현:상품개발가이드참조
	char cum_ccls_qty[12];	// 누적체결수량, 수량단위:천원
	char cum_trd_val[22];	// 누적거래대금, 단위:원, 대금표현:상품개발가이드참조
	`char 결제일자[8];	// 결제일자, YYYYMMDD
	`char 매수총호가잔량[12];	// 매수총호가잔량, 수량단위:천원
	`char 매수1단계우선호가가격[11];	// 매수1단계우선호가가격, 99999999.99
	`char 매수1단계우선호가잔량[12];	// 매수1단계우선호가잔량, 수량단위:천원
	`char 매수1단계우선호가수익률[13];	// 매수1단계우선호가수익률, 수익율표현:상품개발가이드참조
	`char 매수2단계우선호가가격[11];	// 매수2단계우선호가가격, 99999999.99
	`char 매수2단계우선호가잔량[12];	// 매수2단계우선호가잔량, 수량단위:천원
	`char 매수2단계우선호가수익률[13];	// 매수2단계우선호가수익률, 수익율표현:상품개발가이드참조
	`char 매수3단계우선호가가격[11];	// 매수3단계우선호가가격, 99999999.99
	`char 매수3단계우선호가잔량[12];	// 매수3단계우선호가잔량, 수량단위:천원
	`char 매수3단계우선호가수익률[13];	// 매수3단계우선호가수익률, 수익율표현:상품개발가이드참조
	`char 매수4단계우선호가가격[11];	// 매수4단계우선호가가격, 99999999.99
	`char 매수4단계우선호가잔량[12];	// 매수4단계우선호가잔량, 수량단위:천원
	`char 매수4단계우선호가수익률[13];	// 매수4단계우선호가수익률, 수익율표현:상품개발가이드참조
	`char 매수5단계우선호가가격[11];	// 매수5단계우선호가가격, 99999999.99
	`char 매수5단계우선호가잔량[12];	// 매수5단계우선호가잔량, 수량단위:천원
	`char 매수5단계우선호가수익률[13];	// 매수5단계우선호가수익률, 수익율표현:상품개발가이드참조
	`char 매도총호가잔량[12];	// 매도총호가잔량, 수량단위:천원
	`char 매도1단계우선호가가격[11];	// 매도1단계우선호가가격, 99999999.99
	`char 매도1단계우선호가잔량[12];	// 매도1단계우선호가잔량, 수량단위:천원
	`char 매도1단계우선호가수익률[13];	// 매도1단계우선호가수익률, 수익율표현:상품개발가이드참조
	`char 매도2단계우선호가가격[11];	// 매도2단계우선호가가격, 99999999.99
	`char 매도2단계우선호가잔량[12];	// 매도2단계우선호가잔량, 수량단위:천원
	`char 매도2단계우선호가수익률[13];	// 매도2단계우선호가수익률, 수익율표현:상품개발가이드참조
	`char 매도3단계우선호가가격[11];	// 매도3단계우선호가가격, 99999999.99
	`char 매도3단계우선호가잔량[12];	// 매도3단계우선호가잔량, 수량단위:천원
	`char 매도3단계우선호가수익률[13];	// 매도3단계우선호가수익률, 수익율표현:상품개발가이드참조
	`char 매도4단계우선호가가격[11];	// 매도4단계우선호가가격, 99999999.99
	`char 매도4단계우선호가잔량[12];	// 매도4단계우선호가잔량, 수량단위:천원
	`char 매도4단계우선호가수익률[13];	// 매도4단계우선호가수익률, 수익율표현:상품개발가이드참조
	`char 매도5단계우선호가가격[11];	// 매도5단계우선호가가격, 99999999.99
	`char 매도5단계우선호가잔량[12];	// 매도5단계우선호가잔량, 수량단위:천원
	`char 매도5단계우선호가수익률[13];	// 매도5단계우선호가수익률, 수익율표현:상품개발가이드참조
	char filler[7];	// FILLER
	char ff[1];	// FF, END OF TEXT (0xFF)
} 구조체명정의필요;


// 일반채권 종목마감
typedef struct _구조체명정의필요 {
	char data_clsf[2];	// DATA구분, A6
	char info_clsf[2];	// 정보구분, 06:장내일반채권
	char mkt_clsf[1];	// 시장구분, 7:채권
	char isin_code[12];	// 종목코드
	char brd_id[2];	// 보드ID, 코드값모음 참조
	`char REPO기간[4];	// REPO기간, REPO시장만 해당
	`char 종목마감종가[11];	// 종목마감종가, 99999999.99
	`char 종목마감종가수익률[13];	// 종목마감종가수익률, 상품개발가이드참조
	`char 종목마감가격구분코드[1];	// 종목마감가격구분코드, 1 체결가격\n 2 기세\n 3 거래무 (당일 거래무종목은 종목마감 전송되지 않음)\n 4 시가기준가종목의 기세\n 정규장이 아닌 경우 SPACE
	char filler[1];	// FILLER
	char ff[1];	// FF, END OF TEXT (0xFF)
} 구조체명정의필요;


// 일반채권 장운영스케줄공개
typedef struct _구조체명정의필요 {
	char data_clsf[2];	// DATA구분, M4
	char info_clsf[2];	// 정보구분, 06:장내일반채권
	char mkt_clsf[1];	// 시장구분, 7:채권
	char isin_code[12];	// 종목코드
	char brd_id[2];	// 보드ID, ※ 코드값모음 참조
	char brd_evt_id[3];	// 보드이벤트ID, ※ 코드값모음 참조
	char brd_evt_st[9];	// 보드이벤트시작시각
	char brd_evt_code[5];	// 보드이벤트적용군코드, ※ 코드값모음 참조
	`char 세션개시종료코드[2];	// 세션개시종료코드, BS: 보드개시\n BE: 보드종료\n SS: 세션개시\n SE: 세션종료\n SH: 세션정지\n SR: 세션재개
	char sess_id[2];	// 세션ID, ※ 코드값모음 참조
	`char 상장사종목코드[12];	// 상장사종목코드, 종목조치의 기준이 되는 종목코드\n *비상장사의 종목코드도 사용될 수 있음
	`char 거래정지사유코드[3];	// 거래정지사유코드, ※ 코드값모음 참조
	`char 거래정지발생유형코드[1];	// 거래정지발생유형코드, 1: 자기종목 2: 신주인수권증권 3: 신주인수권증서 4: 기초자산ELW\n 5: 발행ELW 6: 상장사 7: 기초자산소
	char filler[3];	// FILLER, SPACE
	char ff[1];	// FF, END OF TEXT (0xFF)
} 구조체명정의필요;


// 일반채권 채권종목정보공개
typedef struct _구조체명정의필요 {
	char data_clsf[2];	// DATA구분, A8
	char info_clsf[2];	// 정보구분, 06:장내일반채권
	char mkt_clsf[1];	// 시장구분, 7:채권
	char isin_code[12];	// 종목코드
	`char 공개정보구분코드[3];	// 공개정보구분코드, ※ 코드값모음 참조
	char brd_id[2];	// 보드ID, ※ 코드값모음 참조
	`char 공개시각[9];	// 공개시각, 공개시각
	`char 이자지급방법코드[2];	// 이자지급방법코드, 고정금리형(11:할인채,12:복리채, 13:이표채, 14:단리채,15:복5단2, 19:기타) 변동금리형(21:이표채, 22:복리채, 23:단리채, 29:기타)
	`char 발행일자[8];	// 발행일자, 발행일자
	`char 상환일자[8];	// 상환일자, 상환일자
	`char 매출일자[8];	// 매출일자, 선매출채권중 원천징수를 하지 않는 은행체등의 경우에만 표기(소액국공채 등은 표기치 않음)
	`char 채권발행율[13];	// 채권발행율, 채권발행율 및 발행가액의 의미를 가짐
	`char 표면이자율[14];	// 표면이자율, 표면이자율
	`char 이자지급계산월수[4];	// 이자지급계산월수, 0:불규칙,0<이자지급계산월수: 규칙의 경우 개월수(이표채,복리채,나머지는 표기하지 않음)
	`char 이자일지급기준구분코드[1];	// 이자일지급기준구분코드, 1:발행일, 2:상환일(채권부 입력사항)
	`char 이자월말구분코드[1];	// 이자월말구분코드, 1:일자기준,2: 말일기준(채권부 입력사항)
	`char 이자원단위미만처리코드[1];	// 이자원단위미만처리코드, 1:절사, 2:절상, 3:사사오입, 4:원미만인정
	`char 채권선매출이자지급방법코드[1];	// 채권선매출이자지급방법코드, 1:매출시,2: 최초 이자지급시, 3:상환시, 4:매출시(국고채유형) ==>'매출형태'가 선매출(1)인 경우에만 사용
	`char 통화구분코드[1];	// 통화구분코드, 1:원화(default), 2:US$, 3:엔, 4:유로화
	`char 만기상환비율[13];	// 만기상환비율, 만기에 상환하는 비율(주로 주식관련사채권의 경우에 많음)
	`char 보장수익률[13];	// 보장수익률, 만기에 발행사에서 보장하는 만기보장 수익률(예:8%등)
	`char 거치개월수[4];	// 거치개월수, 개월수로 입력 ('분할상환구분'이 원금균등, 원리금균등의 경우 사용)
	`char 분할상환횟수[5];	// 분할상환횟수, 분할 상환횟수 표시 ('분할상환구분'이 원금균등, 원리금균등의 경우 사용)
	`char 가산금리[10];	// 가산금리, 가산금리 또는 차감금리 (음수인 경우는 '-' 부호 포함됨)
	`char 당일기준가격[10];	// 당일기준가격, 9999999.99
	`char 은행휴무일이자지급결정코드[1];	// 은행휴무일이자지급결정코드, 1:직전영업일?(직후영업일에 지급시 경과이자 없음)\n 2:직전영업일?(직후영업일에 지급시 경과이자 있음)\n 3:직후영업일 (경과이자 없음)\n 4:직후영업일 (경과이자 있음)\n 5:해당사항 없음
	`char 영구채권만기구조여부[1];	// 영구채권만기구조여부, Y:하이브리드채권 해당 N:미해당'
	`char 표면이자율결정기준금리코드[2];	// 표면이자율결정기준금리코드, 코드 내용은 별도 참조
	`char 이자율결정기준일자[8];	// 이자율결정기준일자, 최초이자에 적용되는 기준금리 적용일자\n (국고채 FRN 해당)
	`char 정리매매여부[1];	// 정리매매여부, Y:정리매매대상 N:정리매매비대상
	char filler[8];	// FILLER
	char ff[1];	// FF, END OF TEXT (0xFF)
} 구조체명정의필요;


// 일반채권 회원제재해제공개
typedef struct _구조체명정의필요 {
	char data_clsf[2];	// DATA구분, R3
	char info_clsf[2];	// 정보구분, 06:장내일반채권
	char mkt_clsf[1];	// 시장구분, 7:채권
	char isin_code[12];	// 종목코드, **: 전종목해당
	`char 공개정보구분코드[3];	// 공개정보구분코드, 711 회원매매거래정지\n 712 회원매매거래해제
	`char 공개시각[9];	// 공개시각, 공개시각
	`char 회원번호[5];	// 회원번호, 회원번호
	`char 회원제재범위구분코드[5];	// 회원제재범위구분코드, 회원의 거래를 허용 또는 제재하는 범위. BITWISE 정의\n 1: 매도(풋매수) 위탁\n 2: 매도(풋매수) 자기\n 4: 매수(풋매도) 위탁\n 8: 매수(풋매도) 자기\n 15:범위구분 전체
	char filler[10];	// FILLER
	char ff[1];	// FF, END OF TEXT (0xFF)
} 구조체명정의필요;


// 일반채권 결제적용기준환율공개
typedef struct _구조체명정의필요 {
	char data_clsf[2];	// DATA구분, R4
	char info_clsf[2];	// 정보구분, 06:장내일반채권
	char mkt_clsf[1];	// 시장구분, 7:채권
	`char 공개정보구분코드[3];	// 공개정보구분코드, 890:결제적용 기준환율공시 \n 891:결제적용 기준환율변경
	`char 공개시각[9];	// 공개시각, 공개시각
	`char 적용환율[13];	// 적용환율, 적용환율
	`char 통화구분코드[1];	// 통화구분코드, 1:원화(default), 2:US$, 3:엔, 4:유로화, 5:위안화
	char filler[8];	// FILLER
	char ff[1];	// FF, END OF TEXT (0xFF)
} 구조체명정의필요;


// 소액채권 우선호가(종류포함)
typedef struct _구조체명정의필요 {
	char data_clsf[2];	// DATA구분, B6
	char info_clsf[2];	// 정보구분, 03:장내소액채권
	char mkt_clsf[1];	// 시장구분, 7:채권
	char isin_code[12];	// 종목코드
	char brd_id[2];	// 보드ID, ※ 코드값모음 참조
	`char 매수총호가잔량[12];	// 매수총호가잔량, 수량단위:천원
	`char 매수1단계우선호가가격[11];	// 매수1단계우선호가가격, 99999999.99
	`char 매수1단계우선호가잔량[12];	// 매수1단계우선호가잔량, 수량단위:천원
	`char 매수1단계우선호가수익률[13];	// 매수1단계우선호가수익률, 수익율표현:상품개발가이드참조
	`char 매수2단계우선호가가격[11];	// 매수2단계우선호가가격, 99999999.99
	`char 매수2단계우선호가잔량[12];	// 매수2단계우선호가잔량, 수량단위:천원
	`char 매수2단계우선호가수익률[13];	// 매수2단계우선호가수익률, 수익율표현:상품개발가이드참조
	`char 매수3단계우선호가가격[11];	// 매수3단계우선호가가격, 99999999.99
	`char 매수3단계우선호가잔량[12];	// 매수3단계우선호가잔량, 수량단위:천원
	`char 매수3단계우선호가수익률[13];	// 매수3단계우선호가수익률, 수익율표현:상품개발가이드참조
	`char 매수4단계우선호가가격[11];	// 매수4단계우선호가가격, 99999999.99
	`char 매수4단계우선호가잔량[12];	// 매수4단계우선호가잔량, 수량단위:천원
	`char 매수4단계우선호가수익률[13];	// 매수4단계우선호가수익률, 수익율표현:상품개발가이드참조
	`char 매수5단계우선호가가격[11];	// 매수5단계우선호가가격, 99999999.99
	`char 매수5단계우선호가잔량[12];	// 매수5단계우선호가잔량, 수량단위:천원
	`char 매수5단계우선호가수익률[13];	// 매수5단계우선호가수익률, 수익율표현:상품개발가이드참조
	`char 매도총호가잔량[12];	// 매도총호가잔량, 수량단위:천원
	`char 매도1단계우선호가가격[11];	// 매도1단계우선호가가격, 99999999.99
	`char 매도1단계우선호가잔량[12];	// 매도1단계우선호가잔량, 수량단위:천원
	`char 매도1단계우선호가수익률[13];	// 매도1단계우선호가수익률, 수익율표현:상품개발가이드참조
	`char 매도2단계우선호가가격[11];	// 매도2단계우선호가가격, 99999999.99
	`char 매도2단계우선호가잔량[12];	// 매도2단계우선호가잔량, 수량단위:천원
	`char 매도2단계우선호가수익률[13];	// 매도2단계우선호가수익률, 수익율표현:상품개발가이드참조
	`char 매도3단계우선호가가격[11];	// 매도3단계우선호가가격, 99999999.99
	`char 매도3단계우선호가잔량[12];	// 매도3단계우선호가잔량, 수량단위:천원
	`char 매도3단계우선호가수익률[13];	// 매도3단계우선호가수익률, 수익율표현:상품개발가이드참조
	`char 매도4단계우선호가가격[11];	// 매도4단계우선호가가격, 99999999.99
	`char 매도4단계우선호가잔량[12];	// 매도4단계우선호가잔량, 수량단위:천원
	`char 매도4단계우선호가수익률[13];	// 매도4단계우선호가수익률, 수익율표현:상품개발가이드참조
	`char 매도5단계우선호가가격[11];	// 매도5단계우선호가가격, 99999999.99
	`char 매도5단계우선호가잔량[12];	// 매도5단계우선호가잔량, 수량단위:천원
	`char 매도5단계우선호가수익률[13];	// 매도5단계우선호가수익률, 수익율표현:상품개발가이드참조
	`char 종류매수총호가잔량[12];	// 종류매수총호가잔량, 수량단위:천원
	`char 종류매수1단계우선호가가격[11];	// 종류매수1단계우선호가가격, 99999999.99
	`char 종류매수1단계우선호가잔량[12];	// 종류매수1단계우선호가잔량, 수량단위:천원
	`char 종류매수1단계우선호가수익률[13];	// 종류매수1단계우선호가수익률, 수익율표현:상품개발가이드참조
	`char 종류매수2단계우선호가가격[11];	// 종류매수2단계우선호가가격, 99999999.99
	`char 종류매수2단계우선호가잔량[12];	// 종류매수2단계우선호가잔량, 수량단위:천원
	`char 종류매수2단계우선호가수익률[13];	// 종류매수2단계우선호가수익률, 수익율표현:상품개발가이드참조
	`char 종류매수3단계우선호가가격[11];	// 종류매수3단계우선호가가격, 99999999.99
	`char 종류매수3단계우선호가잔량[12];	// 종류매수3단계우선호가잔량, 수량단위:천원
	`char 종류매수3단계우선호가수익률[13];	// 종류매수3단계우선호가수익률, 수익율표현:상품개발가이드참조
	`char 종류매수4단계우선호가가격[11];	// 종류매수4단계우선호가가격, 99999999.99
	`char 종류매수4단계우선호가잔량[12];	// 종류매수4단계우선호가잔량, 수량단위:천원
	`char 종류매수4단계우선호가수익률[13];	// 종류매수4단계우선호가수익률, 수익율표현:상품개발가이드참조
	`char 종류매수5단계우선호가가격[11];	// 종류매수5단계우선호가가격, 99999999.99
	`char 종류매수5단계우선호가잔량[12];	// 종류매수5단계우선호가잔량, 수량단위:천원
	`char 종류매수5단계우선호가수익률[13];	// 종류매수5단계우선호가수익률, 수익율표현:상품개발가이드참조
	`char 종류매도총호가잔량[12];	// 종류매도총호가잔량, 수량단위:천원
	`char 종류매도1단계우선호가가격[11];	// 종류매도1단계우선호가가격, 99999999.99
	`char 종류매도1단계우선호가잔량[12];	// 종류매도1단계우선호가잔량, 수량단위:천원
	`char 종류매도1단계우선호가수익률[13];	// 종류매도1단계우선호가수익률, 수익율표현:상품개발가이드참조
	`char 종류매도2단계우선호가가격[11];	// 종류매도2단계우선호가가격, 99999999.99
	`char 종류매도2단계우선호가잔량[12];	// 종류매도2단계우선호가잔량, 수량단위:천원
	`char 종류매도2단계우선호가수익률[13];	// 종류매도2단계우선호가수익률, 수익율표현:상품개발가이드참조
	`char 종류매도3단계우선호가가격[11];	// 종류매도3단계우선호가가격, 99999999.99
	`char 종류매도3단계우선호가잔량[12];	// 종류매도3단계우선호가잔량, 수량단위:천원
	`char 종류매도3단계우선호가수익률[13];	// 종류매도3단계우선호가수익률, 수익율표현:상품개발가이드참조
	`char 종류매도4단계우선호가가격[11];	// 종류매도4단계우선호가가격, 99999999.99
	`char 종류매도4단계우선호가잔량[12];	// 종류매도4단계우선호가잔량, 수량단위:천원
	`char 종류매도4단계우선호가수익률[13];	// 종류매도4단계우선호가수익률, 수익율표현:상품개발가이드참조
	`char 종류매도5단계우선호가가격[11];	// 종류매도5단계우선호가가격, 99999999.99
	`char 종류매도5단계우선호가잔량[12];	// 종류매도5단계우선호가잔량, 수량단위:천원
	`char 종류매도5단계우선호가수익률[13];	// 종류매도5단계우선호가수익률, 수익율표현:상품개발가이드참조
	char filler[2];	// FILLER, SPACE
	char ff[1];	// FF, END OF TEXT (0xFF)
} 구조체명정의필요;


// 소액채권 체결
typedef struct _구조체명정의필요 {
	char data_clsf[2];	// DATA구분, A3
	char info_clsf[2];	// 정보구분, 03:장내소액채권
	char mkt_clsf[1];	// 시장구분, 7:채권
	char isin_code[12];	// 종목코드
	char brd_id[2];	// 보드ID, 코드값모음 참조
	char ccls_time[9];	// 체결시각
	char ccls_prc[11];	// 체결가격, 99999999.99\n 매도 매수 호가간의 거래성사된 가격\n 경쟁대량매매인 경우 0 (경쟁대량VWAP은 체결가격 있음)
	char ccls_qty[10];	// 체결수량, 수량단위:천원
	char sess_id[2];	// 세션ID, 코드값모음 참조
	char ccls_date[8];	// 체결일자, YYYYMMDD
	char trd_val[22];	// 거래대금, 단위:원
	`char 체결수익률[13];	// 체결수익률, 수익율표현:상품개발가이드참조
	char open[11];	// 시가, 99999999.99
	char high[11];	// 고가, 99999999.99
	char low[11];	// 저가, 99999999.99
	`char 시가수익률[13];	// 시가수익률, 수익율표현:상품개발가이드참조
	`char 고가수익률[13];	// 고가수익률, 수익율표현:상품개발가이드참조
	`char 저가수익률[13];	// 저가수익률, 수익율표현:상품개발가이드참조
	char cum_ccls_qty[12];	// 누적체결수량, 수량단위:천원
	char cum_trd_val[22];	// 누적거래대금, 단위:원, 대금표현:상품개발가이드참조
	`char 결제일자[8];	// 결제일자, YYYYMMDD
	char filler[1];	// FILLER, SPACE
	char ff[1];	// FF, END OF TEXT (0xFF)
} 구조체명정의필요;


// 소액채권 체결_우선호가(종류포함)
typedef struct _구조체명정의필요 {
	char data_clsf[2];	// DATA구분, G7
	char info_clsf[2];	// 정보구분, 03:장내소액채권
	char mkt_clsf[1];	// 시장구분, 7:채권
	char isin_code[12];	// 종목코드, 종목코드 및 종류코드
	char brd_id[2];	// 보드ID, 코드값모음 참조
	char ccls_time[9];	// 체결시각
	char ccls_prc[11];	// 체결가격, 99999999.99\n 매도 매수 호가간의 거래성사된 가격\n 경쟁대량매매인 경우 0 (경쟁대량VWAP은 체결가격 있음)
	char ccls_qty[10];	// 체결수량, 수량단위:천원
	char sess_id[2];	// 세션ID, 코드값모음 참조
	char ccls_date[8];	// 체결일자, YYYYMMDD
	char trd_val[22];	// 거래대금, 단위:원
	`char 체결수익률[13];	// 체결수익률, 수익율표현:상품개발가이드참조
	char open[11];	// 시가, 99999999.99
	char high[11];	// 고가, 99999999.99
	char low[11];	// 저가, 99999999.99
	`char 시가수익률[13];	// 시가수익률, 수익율표현:상품개발가이드참조
	`char 고가수익률[13];	// 고가수익률, 수익율표현:상품개발가이드참조
	`char 저가수익률[13];	// 저가수익률, 수익율표현:상품개발가이드참조
	char cum_ccls_qty[12];	// 누적체결수량, 수량단위:천원
	char cum_trd_val[22];	// 누적거래대금, 단위:원, 대금표현:상품개발가이드참조
	`char 결제일자[8];	// 결제일자, YYYYMMDD
	`char 매수총호가잔량[12];	// 매수총호가잔량, 수량단위:천원
	`char 매수1단계우선호가가격[11];	// 매수1단계우선호가가격, 99999999.99
	`char 매수1단계우선호가잔량[12];	// 매수1단계우선호가잔량, 수량단위:천원
	`char 매수1단계우선호가수익률[13];	// 매수1단계우선호가수익률, 수익율표현:상품개발가이드참조
	`char 매수2단계우선호가가격[11];	// 매수2단계우선호가가격, 99999999.99
	`char 매수2단계우선호가잔량[12];	// 매수2단계우선호가잔량, 수량단위:천원
	`char 매수2단계우선호가수익률[13];	// 매수2단계우선호가수익률, 수익율표현:상품개발가이드참조
	`char 매수3단계우선호가가격[11];	// 매수3단계우선호가가격, 99999999.99
	`char 매수3단계우선호가잔량[12];	// 매수3단계우선호가잔량, 수량단위:천원
	`char 매수3단계우선호가수익률[13];	// 매수3단계우선호가수익률, 수익율표현:상품개발가이드참조
	`char 매수4단계우선호가가격[11];	// 매수4단계우선호가가격, 99999999.99
	`char 매수4단계우선호가잔량[12];	// 매수4단계우선호가잔량, 수량단위:천원
	`char 매수4단계우선호가수익률[13];	// 매수4단계우선호가수익률, 수익율표현:상품개발가이드참조
	`char 매수5단계우선호가가격[11];	// 매수5단계우선호가가격, 99999999.99
	`char 매수5단계우선호가잔량[12];	// 매수5단계우선호가잔량, 수량단위:천원
	`char 매수5단계우선호가수익률[13];	// 매수5단계우선호가수익률, 수익율표현:상품개발가이드참조
	`char 매도총호가잔량[12];	// 매도총호가잔량, 수량단위:천원
	`char 매도1단계우선호가가격[11];	// 매도1단계우선호가가격, 99999999.99
	`char 매도1단계우선호가잔량[12];	// 매도1단계우선호가잔량, 수량단위:천원
	`char 매도1단계우선호가수익률[13];	// 매도1단계우선호가수익률, 수익율표현:상품개발가이드참조
	`char 매도2단계우선호가가격[11];	// 매도2단계우선호가가격, 99999999.99
	`char 매도2단계우선호가잔량[12];	// 매도2단계우선호가잔량, 수량단위:천원
	`char 매도2단계우선호가수익률[13];	// 매도2단계우선호가수익률, 수익율표현:상품개발가이드참조
	`char 매도3단계우선호가가격[11];	// 매도3단계우선호가가격, 99999999.99
	`char 매도3단계우선호가잔량[12];	// 매도3단계우선호가잔량, 수량단위:천원
	`char 매도3단계우선호가수익률[13];	// 매도3단계우선호가수익률, 수익율표현:상품개발가이드참조
	`char 매도4단계우선호가가격[11];	// 매도4단계우선호가가격, 99999999.99
	`char 매도4단계우선호가잔량[12];	// 매도4단계우선호가잔량, 수량단위:천원
	`char 매도4단계우선호가수익률[13];	// 매도4단계우선호가수익률, 수익율표현:상품개발가이드참조
	`char 매도5단계우선호가가격[11];	// 매도5단계우선호가가격, 99999999.99
	`char 매도5단계우선호가잔량[12];	// 매도5단계우선호가잔량, 수량단위:천원
	`char 매도5단계우선호가수익률[13];	// 매도5단계우선호가수익률, 수익율표현:상품개발가이드참조
	`char 종류매수총호가잔량[12];	// 종류매수총호가잔량, 수량단위:천원
	`char 종류매수1단계우선호가가격[11];	// 종류매수1단계우선호가가격, 99999999.99
	`char 종류매수1단계우선호가잔량[12];	// 종류매수1단계우선호가잔량, 수량단위:천원
	`char 종류매수1단계우선호가수익률[13];	// 종류매수1단계우선호가수익률, 수익율표현:상품개발가이드참조
	`char 종류매수2단계우선호가가격[11];	// 종류매수2단계우선호가가격, 99999999.99
	`char 종류매수2단계우선호가잔량[12];	// 종류매수2단계우선호가잔량, 수량단위:천원
	`char 종류매수2단계우선호가수익률[13];	// 종류매수2단계우선호가수익률, 수익율표현:상품개발가이드참조
	`char 종류매수3단계우선호가가격[11];	// 종류매수3단계우선호가가격, 99999999.99
	`char 종류매수3단계우선호가잔량[12];	// 종류매수3단계우선호가잔량, 수량단위:천원
	`char 종류매수3단계우선호가수익률[13];	// 종류매수3단계우선호가수익률, 수익율표현:상품개발가이드참조
	`char 종류매수4단계우선호가가격[11];	// 종류매수4단계우선호가가격, 99999999.99
	`char 종류매수4단계우선호가잔량[12];	// 종류매수4단계우선호가잔량, 수량단위:천원
	`char 종류매수4단계우선호가수익률[13];	// 종류매수4단계우선호가수익률, 수익율표현:상품개발가이드참조
	`char 종류매수5단계우선호가가격[11];	// 종류매수5단계우선호가가격, 99999999.99
	`char 종류매수5단계우선호가잔량[12];	// 종류매수5단계우선호가잔량, 수량단위:천원
	`char 종류매수5단계우선호가수익률[13];	// 종류매수5단계우선호가수익률, 수익율표현:상품개발가이드참조
	`char 종류매도총호가잔량[12];	// 종류매도총호가잔량, 수량단위:천원
	`char 종류매도1단계우선호가가격[11];	// 종류매도1단계우선호가가격, 99999999.99
	`char 종류매도1단계우선호가잔량[12];	// 종류매도1단계우선호가잔량, 수량단위:천원
	`char 종류매도1단계우선호가수익률[13];	// 종류매도1단계우선호가수익률, 수익율표현:상품개발가이드참조
	`char 종류매도2단계우선호가가격[11];	// 종류매도2단계우선호가가격, 99999999.99
	`char 종류매도2단계우선호가잔량[12];	// 종류매도2단계우선호가잔량, 수량단위:천원
	`char 종류매도2단계우선호가수익률[13];	// 종류매도2단계우선호가수익률, 수익율표현:상품개발가이드참조
	`char 종류매도3단계우선호가가격[11];	// 종류매도3단계우선호가가격, 99999999.99
	`char 종류매도3단계우선호가잔량[12];	// 종류매도3단계우선호가잔량, 수량단위:천원
	`char 종류매도3단계우선호가수익률[13];	// 종류매도3단계우선호가수익률, 수익율표현:상품개발가이드참조
	`char 종류매도4단계우선호가가격[11];	// 종류매도4단계우선호가가격, 99999999.99
	`char 종류매도4단계우선호가잔량[12];	// 종류매도4단계우선호가잔량, 수량단위:천원
	`char 종류매도4단계우선호가수익률[13];	// 종류매도4단계우선호가수익률, 수익율표현:상품개발가이드참조
	`char 종류매도5단계우선호가가격[11];	// 종류매도5단계우선호가가격, 99999999.99
	`char 종류매도5단계우선호가잔량[12];	// 종류매도5단계우선호가잔량, 수량단위:천원
	`char 종류매도5단계우선호가수익률[13];	// 종류매도5단계우선호가수익률, 수익율표현:상품개발가이드참조
	char filler[3];	// FILLER, SPACE
	char ff[1];	// FF, END OF TEXT (0xFF)
} 구조체명정의필요;


// 소액채권 종목마감
typedef struct _구조체명정의필요 {
	char data_clsf[2];	// DATA구분, A6
	char info_clsf[2];	// 정보구분, 03:장내소액채권
	char mkt_clsf[1];	// 시장구분, 7:채권
	char isin_code[12];	// 종목코드
	char brd_id[2];	// 보드ID, 코드값모음 참조
	`char REPO기간[4];	// REPO기간, REPO시장만 해당
	`char 종목마감종가[11];	// 종목마감종가, 99999999.99
	`char 종목마감종가수익률[13];	// 종목마감종가수익률, 상품개발가이드참조
	`char 종목마감가격구분코드[1];	// 종목마감가격구분코드, 1 체결가격\n 2 기세\n 3 거래무 (당일 거래무종목은 종목마감 전송되지 않음)\n 4 시가기준가종목의 기세\n 정규장이 아닌 경우 SPACE
	char filler[1];	// FILLER
	char ff[1];	// FF, END OF TEXT (0xFF)
} 구조체명정의필요;


// 소액채권 배분정보
typedef struct _구조체명정의필요 {
	char data_clsf[2];	// DATA구분, O6
	char info_clsf[2];	// 정보구분, 03:장내소액채권
	char mkt_clsf[1];	// 시장구분, 7:채권
	char isin_code[12];	// 종목코드
	char brd_id[2];	// 보드ID
	`char 배분적용구분코드[1];	// 배분적용구분코드, 1:배분개시, 2:배분해제
	`char 배분처리구분코드[1];	// 배분처리구분코드, 1:매수상한, 2:매수하한,\n 3:매도상한, 4:매도하한\n 5 매수전가격대, 6 매도전가격대
	`char 배분해제시각[9];	// 배분해제시각
	char filler[9];	// FILLER, SPACE
	char ff[1];	// FF, END OF TEXT (0xFF)
} 구조체명정의필요;


// 소액채권 장운영스케줄공개
typedef struct _구조체명정의필요 {
	char data_clsf[2];	// DATA구분, M4
	char info_clsf[2];	// 정보구분, 03:장내소액채권
	char mkt_clsf[1];	// 시장구분, 7:채권
	char isin_code[12];	// 종목코드
	char brd_id[2];	// 보드ID, ※ 코드값모음 참조
	char brd_evt_id[3];	// 보드이벤트ID, ※ 코드값모음 참조
	char brd_evt_st[9];	// 보드이벤트시작시각
	char brd_evt_code[5];	// 보드이벤트적용군코드, ※ 코드값모음 참조
	`char 세션개시종료코드[2];	// 세션개시종료코드, BS: 보드개시\n BE: 보드종료\n SS: 세션개시\n SE: 세션종료\n SH: 세션정지\n SR: 세션재개
	char sess_id[2];	// 세션ID, ※ 코드값모음 참조
	`char 상장사종목코드[12];	// 상장사종목코드, 종목조치의 기준이 되는 종목코드\n *비상장사의 종목코드도 사용될 수 있음
	`char 거래정지사유코드[3];	// 거래정지사유코드, ※ 코드값모음 참조
	`char 거래정지발생유형코드[1];	// 거래정지발생유형코드, 1: 자기종목 2: 신주인수권증권 3: 신주인수권증서 4: 기초자산ELW\n 5: 발행ELW 6: 상장사 7: 기초자산소
	char filler[3];	// FILLER, SPACE
	char ff[1];	// FF, END OF TEXT (0xFF)
} 구조체명정의필요;


// 소액채권 채권종목정보공개
typedef struct _구조체명정의필요 {
	char data_clsf[2];	// DATA구분, A8
	char info_clsf[2];	// 정보구분, 03:장내소액채권
	char mkt_clsf[1];	// 시장구분, 7:채권
	char isin_code[12];	// 종목코드
	`char 공개정보구분코드[3];	// 공개정보구분코드, 코드값모음 참조
	char brd_id[2];	// 보드ID, 코드값모음 참조
	`char 공개시각[9];	// 공개시각, 공개시각
	`char 이자지급방법코드[2];	// 이자지급방법코드, 고정금리형(11:할인채,12:복리채, 13:이표채, 14:단리채,15:복5단2, 19:기타) 변동금리형(21:이표채, 22:복리채, 23:단리채, 29:기타)
	`char 발행일자[8];	// 발행일자, 발행일자
	`char 상환일자[8];	// 상환일자, 상환일자
	`char 매출일자[8];	// 매출일자, 선매출채권중 원천징수를 하지 않는 은행체등의 경우에만 표기(소액국공채 등은 표기치 않음)
	`char 채권발행율[13];	// 채권발행율, 채권발행율 및 발행가액의 의미를 가짐
	`char 표면이자율[14];	// 표면이자율, 표면이자율
	`char 이자지급계산월수[4];	// 이자지급계산월수, 0:불규칙,0<이자지급계산월수: 규칙의 경우 개월수(이표채,복리채,나머지는 표기하지 않음)
	`char 이자일지급기준구분코드[1];	// 이자일지급기준구분코드, 1:발행일, 2:상환일(채권부 입력사항)
	`char 이자월말구분코드[1];	// 이자월말구분코드, 1:일자기준,2: 말일기준(채권부 입력사항)
	`char 이자원단위미만처리코드[1];	// 이자원단위미만처리코드, 1:절사, 2:절상, 3:사사오입, 4:원미만인정
	`char 채권선매출이자지급방법코드[1];	// 채권선매출이자지급방법코드, 1:매출시,2: 최초 이자지급시, 3:상환시, 4:매출시(국고채유형) ==>'매출형태'가 선매출(1)인 경우에만 사용
	`char 통화구분코드[1];	// 통화구분코드, 1:원화(default), 2:US$, 3:엔, 4:유로화
	`char 만기상환비율[13];	// 만기상환비율, 만기에 상환하는 비율(주로 주식관련사채권의 경우에 많음)
	`char 보장수익률[13];	// 보장수익률, 만기에 발행사에서 보장하는 만기보장 수익률(예:8%등)
	`char 거치개월수[4];	// 거치개월수, 개월수로 입력 ('분할상환구분'이 원금균등, 원리금균등의 경우 사용)
	`char 분할상환횟수[5];	// 분할상환횟수, 분할 상환횟수 표시 ('분할상환구분'이 원금균등, 원리금균등의 경우 사용)
	`char 가산금리[10];	// 가산금리, 가산금리 또는 차감금리 (음수인 경우는 '-' 부호 포함됨)
	`char 당일기준가격[10];	// 당일기준가격, 9999999.99
	`char 은행휴무일이자지급결정코드[1];	// 은행휴무일이자지급결정코드, 1:직전영업일?(직후영업일에 지급시 경과이자 없음)\n 2:직전영업일?(직후영업일에 지급시 경과이자 있음)\n 3:직후영업일 (경과이자 없음)\n 4:직후영업일 (경과이자 있음)\n 5:해당사항 없음
	`char 영구채권만기구조여부[1];	// 영구채권만기구조여부, Y:하이브리드채권 해당 N:미해당'
	`char 표면이자율결정기준금리코드[2];	// 표면이자율결정기준금리코드, 코드 내용은 별도 참조
	`char 이자율결정기준일자[8];	// 이자율결정기준일자, 최초이자에 적용되는 기준금리 적용일자\n (국고채 FRN 해당)
	`char 정리매매여부[1];	// 정리매매여부, Y:정리매매대상 N:정리매매비대상
	char filler[8];	// FILLER, SPACE
	char ff[1];	// FF, END OF TEXT (0xFF)
} 구조체명정의필요;


// 소액채권 회원제재_해제공개
typedef struct _구조체명정의필요 {
	char data_clsf[2];	// DATA구분, R3
	char info_clsf[2];	// 정보구분, 03:장내소액채권
	char mkt_clsf[1];	// 시장구분, 7:채권
	char isin_code[12];	// 종목코드, **: 전종목해당
	`char 공개정보구분코드[3];	// 공개정보구분코드, 코드값모음 참조
	`char 공개시각[9];	// 공개시각, 공개시각
	`char 회원번호[5];	// 회원번호
	`char 회원제재범위구분코드[5];	// 회원제재범위구분코드, 회원의 거래를 허용 또는 제재하는 범위. BITWISE 정의\n 1: 매도(풋매수) 위탁\n 2: 매도(풋매수) 자기\n 4: 매수(풋매도) 위탁\n 8: 매수(풋매도) 자기\n 15:범위구분 전체
	char filler[10];	// FILLER, SPACE
	char ff[1];	// FF, END OF TEXT (0xFF)
} 구조체명정의필요;


// KABI지수
typedef struct _KABI_IDX {
	char data_clsf[2];	// DATA구분, ※개발가이드 참조
	char info_clsf[2];	// 정보구분, 01:장내국채, 07:장외채권
	char mkt_clsf[1];	// 시장구분, 7:채권
	char filler1[4];	// FILLER, 일련번호->FILLER
	char idx_id[6];	// 지수ID, ※개발가이드 참조\n2015.08.03 지수추가(KAP단기채권지수(총수익))
	char base_date[8];	// 기준일자, YYYYMMDD
	char base_time[6];	// 기준시각, HHMMSS(종가지수일 경우 : JUNJJJ)
	char tot_prf_idx[10];	// 총수익지수, 9(6)V9(4) (기준:100)
	char cln_prc_idx[10];	// 클린가격지수, 9(6)V9(4) (기준:100)
	char mkt_prc_idx[10];	// 시장가격지수, 9(6)V9(4) (기준:100)
	char call_rinv_idx[10];	// Call 재투자지수, 9(6)V9(4) (기준:100)
	char zero_rinv_idx[10];	// Zero 재투자지수, 9(6)V9(4) (기준:100)
	char fut_thr_prc[9];	// 선물이론가격, 9(7)V9(2) ※ 산출하지 않음. \n '0'으로 고정
	char avg_dur[6];	// 평균듀레이션, 9(3)V9(3)
	char avg_cnvx[6];	// 평균컨벡서티, 9(3)V9(3)
	char avg_ytm[6];	// 평균YTM, 9(3)V9(3) (%)
	char avg_fwd_ytm[6];	// 평균선도YTM, 9(3)V9(3) (%) ※ 산출하지 않음. \n 0으로 고정
	char filler2[1];	// FILLER, SPACE
	char ff[1];	// FF, END OF TEXT (0xFF)
} KABI_IDX;


// KABI지수 구성종목정보
typedef struct _KABI_IDX_COMP_STK {
	char data_clsf[2];	// DATA구분, ※개발가이드 참조
	char info_clsf[2];	// 정보구분, 01:장내국채, 07:장외채권
	char mkt_clsf[1];	// 시장구분, 7:채권
	char filler1[4];	// FILLER, 일련번호->FILLER
	char idx_id[6];	// 지수ID, ※개발가이드 참조\n2015.08.03 지수추가(KAP단기채권지수(총수익))
	char base_date[8];	// 기준일자, YYYYMMDD
	char base_time[6];	// 기준시각, HHMMSS(종가지수일 경우 : JUNJJJ)
	char isin_code[12];	// 종목코드
	char base_prc[9];	// 기준가격(평가가격), 9(7)V9(2)
	char cln_prc[9];	// 클린가격, 9(7)V9(2) ※ 산출하지 않음.
	char ytm[6];	// (확정)YTM, 9(3)V9(3)
	char idx_icpr_id[1];	// 지수편입여부, 1:지수편입종목 0:지수에 편입되지 않으나 ETF에 편입된 종목
	char filler2[3];	// FILLER, SPACE
	char ff[1];	// FF, END OF TEXT (0xFF)
} KABI_IDX_COMP_STK;


// REPO 종목 거래일물가능 정보
typedef struct _REPO_STK {
	char data_clsf[2];	// DATA구분, S0
	char info_clsf[2];	// 정보구분, 05:장내RP(REPO)
	char mkt_clsf[1];	// 시장구분, 7:채권
	char isin_code[12];	// 종목코드, 표준코드
	char snr[8];	// 일련번호, 1~99999999 건수체크용
	char repo_prd[4];	// REPO기간, 1,2,3,4,7,14,21,30,60,90일물
	char filler[10];	// FILLER, SPACE
	char ff[1];	// FF, END OF TEXT (0xFF)
} REPO_STK;
