////////////////////////////////////////////////////////////////////////////////
// Description  :
// File Name    : termclear.c
// Author       :
// Notes        :
//收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收收
// Date         : 
////////////////////////////////////////////////////////////////////////////////
#include <unistd.h>

/*******************************************************************************
 * TTY蒂 Clearи棻.
 * Prototype : void TermClear(ttyfd)
 * Argument  : void ttyfd; terminal FD
 * Return    : void
 ******************************************************************************/
void TermClear(int ttyfd)
{
int n = 1;
char c;
	while(n) n = read(ttyfd,&c,1);
}
////////////////////////////////////////////////////////////////////////////////
// Program End
////////////////////////////////////////////////////////////////////////////////
